{"review_id":"lZXuWO--oDQt4nG9gjgnJA","user_id":"BsPTBl0_5rZXrfVP4HffqQ","business_id":"QLUUaTj034zYVWiVl9tNvA","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"I found this place very elegant and quaint. The servers couldn't have been nicer! \nMy mother and I went here for lunch and were delightfully surprised at the Breakfast and Lunch only menu. She had the breakfast melt, and noted that the eggs were cooked precisely to her liking. I wanted the BLT but can't eat tomato. So any chance I can find a place willing to swap Tomato for Avocado on a BLT, I take it. Beautiful, just beautiful. \n The portions are perfect and a choice of grits or home fries come with almost every meal. If you're on this side of town and looking for something new, give this place a shot!","date":"2010-10-27 04:48:24"}
{"review_id":"RdgegJEIJTrqaNZMpYwwEg","user_id":"sPvE9DV8ZgzmIzuHR2hdTA","business_id":"ceYAlSS9-da8wi_x-0ZKkg","stars":5.0,"useful":5,"funny":0,"cool":0,"text":"Anyone who comments badly on this company or others like it, clearly do not know how file recovery works...\nFile recovery is never guaranteed, you pay for the service, which is simply an attempt at recovering any data.\nMaybe if people knew this (it is very basic information) they wouldn't get so upset.","date":"2016-02-18 03:13:09"}
{"review_id":"8_iRwY5MqoLlW4qofXWZaw","user_id":"Zn8tgekH0oCfyk4SUtygoA","business_id":"Swjkmg5qAHT6hwXQRWQoHQ","stars":5.0,"useful":20,"funny":8,"cool":15,"text":"This is a reliable place to hold a happy hour for a large group. They always provide excellent service and they have an awesome long table for 20+ made out of one huge tree. \n\nYou can sit inside or outside, depending on the weather and your whim. As for drinks, they have a full bar and solid assortment of beers. \n\nWhile the atmosphere is nice, it's the service that encourages us to return.","date":"2020-02-12 08:50:33"}
{"review_id":"JkB9RQxHko3F06xzAX9GHw","user_id":"nR6IQ9lQrU_NyBdbWuuVmw","business_id":"uxoQdZD3mEptaPohiLQg1w","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We know the owners from Your Moms Place in Phoenixville so we had some expectations. They were beautifully met.  Brunch for the 3rd Sunday in a row was relaxing, well serviced and the food was exactly right.  I strongly suggest the French toast soufflé, it was light and delicious and made from the Chefs family recipe. You can tell my boyfriend loves the fig and goat cheese omelet. Ingredients are locally sourced and the renovated interior is really spot on. Cant wait to explor the dinner menu.","date":"2019-06-17 16:27:51"}
{"review_id":"U-sbjkKbGXaAy7fZ99NuBA","user_id":"nsf7URUC6lw-NTa7rCMYbg","business_id":"_9x1oSQghxEPuUeb5NPShw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Food was ok...too Smokey no air circulation. We got the 7 course meal for 2 pricey and you don't get much food. It came out very very slow we had to leave bc other half had irritated asthma bc of lack of any air in there. They still charged us for the whole 7 course...smh which we didn't get. Really had it came out faster instead of a 25 min wait in between smal courses well we probably would of made it all the way through. The appetizer was awful...salad was delicious and so was the bread. Chicken not cooked enough for my liking. I will not return here....yuk","date":"2015-12-14 02:25:51"}
{"review_id":"nUcjdZDwbSGWjgkivRWd-A","user_id":"8xqel8LznqBV6nDtAbZt5A","business_id":"VZfc50XVwgdCecH4YbGNFg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"AMAZING. I got wings, onion rings, and mac and cheese and everything was perfect.. literally could not have been better. I actually made a yelp account just to review this place. It doesn't look like much inside.. not that its shabby, it just doesn't come close to reflecting the quality of the food. When I pulled up I was nervous because the parking lot looked pretty empty, but I was not disappointed when the food came out. Some of the best wings Ive ever had, and the mac and cheese should get its own page with a picture on the menu! I'm going back as soon as possible to try a burger. YUM!!!","date":"2014-04-30 20:49:35"}
{"review_id":"3Yz8eiSZMU4ID6HZzV01AA","user_id":"FhVw-8GMT_yTo2dP7oIgOw","business_id":"eFwFIh7olBwMHQ6ByoRH-Q","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"My husband happened to stroll by this place. He came back to get us from one of the gift stores to go\nthere and have a treat.\n\nAnd what a treat it was! You walk in and your sense of smell is romanced with all kinds of amazing scents. Caramel corn, regular popcorn, waffle cones, candy and espresso! I'd like to hang my laundry on a clothesline in there. Oh the simple joys!\n\nMy husband had the turtle sundae, my mother in law a vanilla bean waffle cone and I had a... Wait for it...\n\nAn AFFOGOTO! They are all fancy up in here!!!! A fresh shot of espresso brewed over a scoop of their amazing ice cream. Lord have mercy. I tried the espresso over the Marion-berry ice cream. I had originally asked for mint chip but the mistake was a delicious one. They must have gotten confused when I asked for a marion-berry sample.\n\nIf you are on 13th and you like ice cream you'd be crazy not to come here and give Goody's a try.","date":"2016-06-20 22:48:37"}
{"review_id":"7ZuVtV80H2CBb4ZjyrDPJg","user_id":"d2SmmiFbMXUxT5-cTzu0OQ","business_id":"D4AJVjAiJULF04BjN7bhiA","stars":2.0,"useful":0,"funny":2,"cool":0,"text":"I was here with a party of 10 for my friend 24th birthday.  Their tapas were all right. \n\nI recommend this place for drinks with some friends amongst a crowd of classy dressed people.  Other than that, their food really stunk.  I had gotten their NY Strip Steak With Sauteed Mustard Greens and Blue Cheese Butter which was not good.  I asked for medium rare and it came out medium well.  Not only that, the NY strip steak was salty as if they were masking how old the steak may have been?  Not sure but if one is to pay $24 for a steak, you would assume that it would be at least good.  The potatoes were just potatoes at least they got that right.  If you screw up potatoes, then you suck.  I got a glass of their cheapest red wine which wasn't bad.  It was called De Bortoli Merlot.  Just Merlot.  Whatevs.  We had a taste of all the tapas which is never filling.  The tapas were okay, nothing special.  If you want great tapas, you should go to Amada's, which is the best tapas place in Philly in my opinion.  Overall, if you wanna just a casual drink, small talk, and look cool then I guess come here cuz Rittenhouse is nice but food sucks.  Eat Ramen.  Save Money.","date":"2010-09-08 19:41:10"}
{"review_id":"WMyQvgplupZOWRI32ToBWQ","user_id":"CzovhHDhg6P1QHByR-_jOQ","business_id":"M0c99tzIJPIbrY_RAO7KSQ","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Booked my wedding here on oct 21, 2017 and had a wonderful experience.  First of all, Jessica, the Wedding Sales Manager, is so helpful and was a big part of planning my big day.  I def could not have done it without her, she helped with everything from the cake, the food, the ceremony itself and so much more.   Secondly, this venue is beautiful and has an amazing view of the arch.  Everyone raved about our outdoor ceremony and dance floor.  Also the Hyatt did all of our catering including the cake and everything tasted and looked wonderful.  The staff at the hotel were extremely nice and helpful, particularly Keith, who assisted us with check in.  The Hyatt also provides us with mimosas the day of the wedding and champagne and chocolate covered strawberries when we returned to our room.  Everyone told us they had a wonderful time and I am so glad we chose this for our wedding.","date":"2017-11-03 00:59:34"}
{"review_id":"tQjIMHlCBzfkeelFnyimlg","user_id":"kzSv6k5KUUgdJ2VU4tGqxA","business_id":"Yv9KUZ-N3otoKUtToPPxAg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best spot to eat in Doylestown. The food is consistently good, the staff is friendly, the drinks are awesome, the atmosphere is so cool since it's connected to the Doylestown inn. I feel like this is a staple to the town and I'm glad it's being managed by extremely competent and friendly people that continue to make it better.  Try the steak house benedict with one of the wide variety of delicious and potent cocktails and you wont be sorry.","date":"2018-07-08 01:30:27"}
{"review_id":"36s_chbAO2rcpRPonPFccg","user_id":"uZSg9lxiPPczGXc6-JWwxg","business_id":"L-YdO_NODKXXT3bkS0nUpg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We were excited to visit this place because we saw the large aquarium view while dining. The service was amazing and the food was great and so fresh! I will definitely be visiting again.","date":"2020-03-07 17:30:50"}
{"review_id":"-ja2Ip5GdOEdgeWS4lesmQ","user_id":"R38kCeGtVQqEwB1BxSx_8g","business_id":"Mha77MN_BYGB-w7DONZ5YA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Anytime I come here I get the steak and chicken combo and it is always delicious. Not the most comfortable place to sit in but the folks make up for it with their amazing food!","date":"2020-08-02 01:58:56"}
{"review_id":"8IWsKvui6POiWANQz87RdQ","user_id":"I7-o-ivxpPRrF7-N5qUhlw","business_id":"HKLFG2qKkd5X1IyfwYlYqQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Probably the closet thing to your grandmas fried chicken. The wait time is a little long but it's worth it.","date":"2017-11-13 23:37:16"}
{"review_id":"r2yA4STo6_0l98S_YRSCEQ","user_id":"AUi8MPWJ0mLkMfwbui27lg","business_id":"jix9Vl-uIgl39Gqx75QaLg","stars":4.0,"useful":2,"funny":0,"cool":0,"text":"This was a good clean property.   Awesome views of the mountains and dessert.  The room was totally up to date and even had a gas grill on the patio so I could grill some steaks.   I will be back to visit. \n\nOn a side note the only negative is that if you are going South of Tucson this may not be the best place as it is on the north side of the city.  This means you waste a little bit of time going through the city and if you hit the traffic wrong you could waste quite a bit of time in gridlock.","date":"2010-10-09 15:56:51"}
{"review_id":"D868_JVDxmbcW84-G9V5bQ","user_id":"yx2WqokV-srg1VxvPJ109g","business_id":"ZPLY1Oa21HFU0_G5cBjf-g","stars":3.0,"useful":2,"funny":2,"cool":1,"text":"It's a normal Papa John's. We order from here every now and then when we feel like a quick and cheap pizza fix. I've never had any problems with this location - our food is always ready on time and made correctly. It's not gourmet, but it'll do.","date":"2015-11-04 16:14:06"}
{"review_id":"IEoYzQjWtqNmvnORJmJPRg","user_id":"oMcmerArbeL0OOEZVPMeuQ","business_id":"DRr5xdfHtqgWfhmdTU1B8Q","stars":5.0,"useful":2,"funny":1,"cool":1,"text":"Burgers are amazing not to mention their drink specials!! So many different beers and drinks! Staff is amazing especially the bartender on weeknights kelley she makes you feel so warm and welcome to the establishment! Crowd is friendly and locals I highly recommend this place!","date":"2012-01-21 04:17:29"}
{"review_id":"je4j303DxCBO9QNuwoCA3g","user_id":"TLI72nISEXIYDsF7wAE8-A","business_id":"8rb-3VYXE37IZix4yOdskw","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"I would go lower than one star if I could. They don't clean anything in there. I went there and had three drinks and was throwing up for 7 hours. They don't clean their soda lines and I doubt they clean much else. If they don't care about the health of their customers they don't deserve to even be open. I will never be back and I hope they go out of business and are replaced by someone who actually cares.","date":"2016-12-28 12:55:35"}
{"review_id":"haQ9d-x55Nn1HWB4N0xMgw","user_id":"3kXfnV_qigA-jfF8hOeC0g","business_id":"Udlivg8oVF_JRgfL5TV33w","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"ALERT: WEDDING TAX! I wanted to book a transfer for my wedding day. I wanted to get myself and my 12 bridesmaids from my house to the venue. When I did the online quote I noticed that if you chose the wedding option the cost was $715 but if you chose the transfer option (with ALL the same parameters) the cost was $315. I figured there must be a mistake or maybe something special was added for the wedding package. So I called and Carlos answered. I explained and he said the wedding package costs more because you get to have the limo for 3 hours and a transfer was just a drop off. I was like oh great, I just need the drop off. He then said, oh sorry you can't have  just the drop off because it is a wedding we have to charge you the wedding rate. I was confused by this answer and asked why this would be the case. He said, it was because for a wedding they don't book trips before or after to make sure you get there on time because \"no one could predict traffic.\" Again, I was confused by this and said well don't you also guarantee a timely arrival for all of your services? I would imagine that if you are in the business of getting people where they need to go that would be important. He said well no of course we are always on time. At which point I was just more confused. Bottom line, they will up-charge you (more than double) because someone is wearing a white dress.","date":"2020-02-01 21:05:59"}
{"review_id":"oP8C8vEpJM-jjBsRoUtB_Q","user_id":"H8vIA5M9ZMDNiEQBa-TrbQ","business_id":"5xokROlB8Zo5T-_qbHzsrQ","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"Yumm && what a wonderful experience at Buddy Brew. \n\nA variety of delicious coffee drinks and flavors!! \n \nThe environment is very nice & inviting. I like the vintage & restoration hardware feel to the shop. The high ceilings are nice in making the space look and feel larger. \n\nI absolutely love their toast breakfast options. There is a variety of toppings: cheese, tomato, avocado, salmon & prosciutto etc. to choose from. I plan on trying their pastries next!","date":"2015-03-17 15:52:50"}
{"review_id":"Fgx-qdXq3tqN9XasXIqfjA","user_id":"8ZbVVVisjchTF6FryqkWWw","business_id":"Zx7n8mdt8OzLRXVzolXNhQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"My boyfriend and I were visiting from NY and we saw this cute little spot and just has to try it. We were expecting a huge wait but both times we went they sat us down immediately. The hostesses were so extremely nice and accommodating to us wanting to sit outside. The first time we went we went for breakfast. My goodness, the food was INCREDIBLE. We were so impressed that we made plans right then and there to make it our last stop of our trip on our way back to NY and that's exactly what we did. This time we got lunch and yet again not disappointed at all! I wish there was one of these closer to home!","date":"2018-08-16 20:32:14"}
{"review_id":"hvoBeQ6mbPpqK_yi0-YMkg","user_id":"7bB4V2bchlMbdWVosxMmsg","business_id":"gXg277YblY5xsaeMzJ73TA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"We went on a Tuesday evening and got right in.  Our service was fast and attentive.  We ordered Craig. Rangoon and it was good, but lacking in crab.  We also had the Vietnamese  spring rolls that were delicious.  For entrées we had General Wang and bankok Boom.  Both were awesome as we wanted them extra extra spicy and they supplied us with a spoon and some sombal oelek to add to it for our preferred spice.  A very good meal.","date":"2017-06-07 01:24:40"}
{"review_id":"H4UDPV6v51womdLPK1VegQ","user_id":"Y3SK5UfMfDWwXG4u1qEwrA","business_id":"5pjdRZ9BgW70S5TO2jQY7w","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"This is a really nice RV Park. Everything is clean, super friendly and helpful. The pool and jacuzzi are clean and lots of things to do if you have kids. \nThey also have these fireplaces with tables and chairs to gather around the fireplace.","date":"2018-06-18 01:50:42"}
{"review_id":"NHf3PVHAIQWJTYBmIi4hQA","user_id":"YKC62O4t7JtPVs0msMsdPg","business_id":"hS6KNGCQVTYUdLb2edt58g","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"The Natchez provides a great tour of the Mississippi River in a steam powered paddleboat.  The first half of the trip is narrated and the second half is a live jazz band.  The Natchez paddleboat itself is a pleasure to explore, they provide a walkthrough of the steam and engine room.  Upgrade your ticket and get a home cooked style lunch, the food is well worth it.","date":"2013-11-08 03:40:02"}
{"review_id":"jO0Tz1ALCLiDKLkfyVf0sg","user_id":"Pu1BCVdqDiqBd9ZAww1WLQ","business_id":"jULIPydhMj18KOI5OHTwfA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Good spot to stop in and grab a quick taco and margarita. This place does get pretty busy though. I wish they had more outside seating. They make great fish tacos. And they give you the option to have them grilled or fried. I love the grilled. They change the menu up pretty often to keep things interesting. The margaritas are a wildcard. Last time I was in I asked about the featured margarita and the bartender straight up told me it's green apple and watermelon and it's gross. I appreciated the honesty and went with the prickly pear which honestly was also gross. I gave the margaritas a second chance though and the regular strawberry one was good. So beware of the strange margarita flavors but the food and traditional margaritas are good for a quick bite.","date":"2019-04-05 20:41:37"}
{"review_id":"9thZ1ptN-UbWxJa1DGuVjA","user_id":"ffQ56JVXRQWJFDYktttDQg","business_id":"7IU6885SDuzEA9JfrP--uQ","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"Love this place! The biggest pancakes and such friendly service! The Greek omelet was delicious, and huge along with the pancakes. The items are priced really well for the portion size!","date":"2019-07-18 00:06:42"}
{"review_id":"xVGTGx9kjk36VdFfg3Zhog","user_id":"aokIG3a8-Nkka1se5ZCm-g","business_id":"lN_9tSK-zUZyCAkVykKfoA","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"The best place to see live comedy in Tampa Bay hands down.  I go to a lot of live comedy shows. This place always delivers. Great opening comics. Great headliners in a very intimate setting. The best thing is you can reserve your seats on line!  You don't have to get there an hour and a half before the show starts to get a decent table. I've been there probably 20 times (seriously) in the last 2 or 3 years and the servers are always great the drinks aren't watered down, and the food is good too. On the food bit, I have to admit we don't usually order food.  We usually only get cocktails, but the few appetizers and desserts we have ordered were good. The management also does a great job when an audience member doesn't take the hint that everyone else in the room didn't come to see them.","date":"2015-06-22 18:11:46"}
{"review_id":"ij-zP_MvU3oqE2obfQwjrA","user_id":"DAXqil0JQNZYNthSnCGZsA","business_id":"Y-8sBabLwWnj9h_IUPbA8g","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I was directed to Pop-A-Lock via Honda Roadside Assistance at 9:30 pm on a weeknight. I was told the wait could be up to an hour. Geraldo was not on the clock when the call came in, but he noticed that all the other available technicians were nowhere near me, so he came and got there within EIGHT minutes. It was amazing how fast he got there. It's nice to see a company that goes above and beyond. Within another few minutes, he had jumped the car. He was friendly and professional. The cost was covered by Honda, so I can't weigh in on pricing, but I'd definitely recommend Pop-A-Lock.","date":"2018-01-11 18:59:13"}
{"review_id":"5g_Sj71SbJ7fRmnnDVCTwA","user_id":"_uYGXjcqCMm-2obsYsLa-w","business_id":"T4-vocFpzwlIxAQIi22FFA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Absolutely fantastic!\nBest breakfast I've had in decades!  Husband had the crab eggs Benedict and I had the Belgium waffle. Both were delicious.  Coffee had a wonderful flavor and the mimosa\"s were perfect.  To top it off, our server Henry was better than our service at 5+ star resort.  We will definitely be back!","date":"2020-10-24 14:34:16"}
{"review_id":"KT6RHAm15dnU2zBUq9clFQ","user_id":"tOMztypmq06beq-zncxjiw","business_id":"WIv5kTb_P3jnngPkMeRRNw","stars":3.0,"useful":1,"funny":0,"cool":0,"text":"This is a great lunch spot in Center City.  The sushi isn't the best I've ever had, but it's definitely good.  It's also reasonably priced.  I would get the spider roll consistently and have had a few of their other rolls.  Haven't had a bad experience yet.  I would recommend this place as a reasonably priced lunch spot with friendly service.","date":"2011-06-08 01:58:10"}
{"review_id":"5nVBxx7KANiu5gj5YB4y7w","user_id":"0NWPSRVvpTA0JGxAVvovPQ","business_id":"CEtW6hZfqqd888WFdxv2lw","stars":1.0,"useful":2,"funny":0,"cool":0,"text":"Decided to meet my siblings at Augie's for dinner Saturday night.  I had eaten at Smiley's many times over the years and their food had always been very good.  One of my sister's got there at 7:30pm.  The rest of us were on our way.  She texted us and said she was seated and that she was told we would be the last table seated as they had a wedding in the back room at 8:00pm.  The rest of us arrived at 7:35pm and saw numerous people entering the restaurant in dress clothes.  We felt uncomfortable as though we were intruding on this couple's wedding and voiced that concern to the waitress who assured us we were fine to stay and order.  There were three other tables seated in the restaurant.  Before we ordered the bride and groom entered which made us feel even more uncomfortable and I didn't know how we would be sitting at tables next to wedding guests and eating our dinner.  We ordered quickly so as to hurry and get out of the way and I wish now that we had just left so as not to intrude on the private wedding party.  One of the two waitresses brought the table a basket of garlic french bread which was very good.  I ordered a seafood gumbo and stuffed mushroom and the rest of the table ordered chicken parmesan.  The gumbo had a good color and 5 or 6 (21\/25 count) shrimp but it had NO flavor.  The stuffed mushroom appetizer had 4 mushrooms.  The mushrooms were stuffed then breaded and fried and covered with what I believe was supposed to be some kind of mayonaisse sauce but it was very lacking.  I could not taste anything but mayonaisse so I can't say whether the mushrooms were good or not as I only ate a couple of bites because I couldn't get past the taste of mayonaisse.  The chicken in the chicken parmesan was tough and the two people who ordered it did not eat it. We quickly paid the bill which was brought to the table before we even got the food but the waitress did say there was no hurry.  The twenty minutes we were there guests continued to pile into the restaurant and sit at tables around us while other staff passed hors d'oeuvres to them, other guests lined up at the bar for drinks and a band began to play as the bride and groom began their first dance as husband and wife.  I wish I could have apologized to the couple and their guests for intruding on their special occasion.  Seating regular diners within 25-30 minutes of a private function commencing was a mistake of the management who made that decision.  However, worse than that decision was the food.  I don't think I will ever give it a another chance.  I guess in the time it took to transition from Smiley's to Augie's the chef's who were preparing the delicious food found new jobs elsewhere.","date":"2017-08-10 16:22:28"}
{"review_id":"nRYgQJm_S6DFgo6-DJvq0Q","user_id":"3BjFzu4wAbm3utXFhVkP7w","business_id":"1JtpcHELRrSDoWS80WtzuQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Neat setup here. They have a bunch of good comfort\/home style foods- I wanted to try all of it I ended up ordering a burger. All the sides were super good and  flavorful and then my burger was so bland- I was pretty bummed about that, especially since it was cooked perfectly medium rare. Everything else I had there was really good though so I'm trying to see the positive side. I also got a slice of cake and it was phenomenal! It took me about a week to finish though because of how massive it was haha","date":"2019-10-31 16:20:58"}
{"review_id":"DGD0EYX1cc2f-En5y_Bm9Q","user_id":"GliKeTwOouyVbaa7YrT22g","business_id":"ioAcpe5KRvacB2lna-wdaw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best pizza around for sure! Great crust and sauce and super character doing the assembly and baking!","date":"2018-09-21 15:47:38"}
{"review_id":"MLMZvqssfp5iIX-aZswMmA","user_id":"9GLVibkLi-2q5y_ddWs7Ow","business_id":"nBFs70QJ40fvV5SwwBa1Mg","stars":1.0,"useful":0,"funny":1,"cool":0,"text":"I always fly Alaskan air because they are usually very accommodating and the price is right. I got to the airport 5:17 AM my flight was to leave at 6 mind you I live in a tiny tiny town and the airport it's really small. when I got there the ticket counter had closed at 5:15 mind you my flight leaves at 6 and they only had two people working the counter \nAnd the same two people had to run up to the gate to board passengers, what kind of rinky dink operation is that! as well. I could not check in at the counter nor at the kiosk and they would not be back till 7 and my fight left at 6. Why does it take them an hour to get back down to the counter?\n. Someone told me to go to American Airlines since they are the owner of alska and they would be able to help me but of course again no help. people were rude and it seemed as they hated their job. why  can't they hire enough people to work the counter and the gate. I called and they said they could get me on the 8:30 p.m. flight but it would cost me an extra $200. what a freaking joke! Alaska, if you can't provide enough people to cover a shift don't have such early flights! never again or how about hiring a couple  people.WOW! WHAT A CONCEPT!  You got all stupid on us!!!","date":"2015-06-05 13:44:44"}
{"review_id":"SOadskr9kNBaHaigyRC4hQ","user_id":"8VPCVY70TcE353gRruotWQ","business_id":"kk_oEw1j3xQ-cJaAII8A0Q","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Conveniently located, with friendly staff and clearly marked aisles. I stopped in most recently to pick just a few things up, and they weren't hard to find. I had some trouble trying to get the discount when checking out, but that was the manufacturer's fault, not the store's.\n\nThe store is clean and a good size. It'd be nice if this one had the scanners you can bring around with you, but other than that it's pretty good.","date":"2018-03-01 21:30:08"}
{"review_id":"ucrbZYlFi0a0HQjc_VlhNA","user_id":"XygxEnqYBPeGgX7jW9hYzA","business_id":"w6zTQy50KWIqP3sTgIx1BQ","stars":1.0,"useful":5,"funny":0,"cool":0,"text":"THIS IS AND WILL BE THE WORST PLACE TO GO FOR MEDICAL HELP!\n\nMy appointment was on May 8th for a series of illnesses and issues. The doctor had requested for me to get a series of tests done. Unfortunately i didn't receive pre-authorization codes for certain tests when i was at the office so i had to call back. An hour after i left the office i had left a message on the referral line. I didn't expect to hear from them that same day because working in a medical office before i understand the day can get pretty hairy so i waited a day or so. Still no response...so i called again and again and again. Did i get any responses back? Nope! At this point i had left 4 messages on the voicemail and 2  verbal messages with the so called receptionists and referral people. It will be a week tomorrow and still no answer. \n\nThis office's work ethic is an atrocity! I rather die then come back to this office.","date":"2014-05-14 19:32:47"}
{"review_id":"AFUuoNUm2gpqJXBtTsmFDg","user_id":"pTG_I0Lb7ou53MIHg99MAg","business_id":"YisnHfR8rvlYFNtauQF14w","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"We've been ordering from Nelly's for 2 years now. It is absolutely delicious. Every Friday night my kids BEG me to pick up Nelly's on the way home.My kids love their pork tacos with a side of white rice and I usually order the chicken soup and platillo casado which feeds you for 2 days straight!\nWe've never had a bad experience.\nPeople continually rave about the new food truck in the area but I think that's because they've never tried Nelly's food. Tastier, larger portions and much cheaper. Seriously, go to Nelly's. I swear you'll love it.","date":"2017-11-09 16:00:16"}
{"review_id":"IaEkvPbXb_9xaLl0TkJ0kQ","user_id":"eRYpNz5_EHSwwrpX7lyuxg","business_id":"Zx7n8mdt8OzLRXVzolXNhQ","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Milk and Honey is a GEM. Not just saying this because I'm a local but because I truly love love the service and food they offer. I recommend getting there with a good amount of time you will have to wait at 40-45min. Trust me the wait is well worth it. I recommend the biscuits they are Phenomenal!! Also their quick cafe for sweets and coffee is amazing order the Nutella homemade pop tart!!!","date":"2018-01-10 16:10:17"}
{"review_id":"JvZfm_XjRtMsX3mdTKckig","user_id":"GCwTGPYEpZ_JmKoouE-ICw","business_id":"6kpEWkDPANbhuNWFQKVk1g","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"I had an active Groupon (over 24 hours after purchase) that clearly specified 110 Carriage Lane in Delran, NJ as one of the locations to use. I went there and was told that I could not use it and that an oil change was $99.00! I will NEVER patronize this location again and would prefer not to give them any stars. I had to contact Groupon and figure out another Groupon deal to exchange it with.\n\nI appreciate your feedback, but HOW do I go about emailing you? You did not leave any contact info. I contacted the main office. You do understand that Yelp has no option for reply, right?","date":"2021-04-18 14:17:24"}
{"review_id":"CG3ut9MCuODs0lK35Je1zw","user_id":"5FcwOjt5aeQOIgHaHTzYXg","business_id":"TTsBa6e2qgIEkiFQfYLmYA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Good soft serve ice cream and friendly employees.","date":"2018-03-02 23:27:13"}
{"review_id":"zEPkicSkqLrX8VWQ7WtrwA","user_id":"9Qw7PWYwDSL3d2G4-sJ-Sw","business_id":"D73evJ9PZKxO3E5TaThe3w","stars":3.0,"useful":9,"funny":5,"cool":5,"text":"The food is very mediocre Mexican inspired dishes. The real star here are those frozen concoction makers behind the bar. There is a reason you might mistake them for a daq shop when you see them lined up. Happy hour is key! Get your money's worth. I don't do the alternative flavors I get the house, frozen, no salt. Simple.","date":"2017-09-12 03:19:31"}
{"review_id":"gy0olNFXCXZqwOWdc2pkFg","user_id":"pDqDNFJFfH1Ztg76_TQOpg","business_id":"a2GIcDZ0P6ABM-_siJfmjg","stars":4.0,"useful":4,"funny":0,"cool":1,"text":"I consider myself a spiritualist and I have been to many a new age shop. I recently moved into this neighborhood and decided to do some exploring around and I was delighted to stumble upon this shop. It's huge! It has so much to offer, stones and crystals, giftware, aromatherapy products, Buddhist, Hindu and Feng Shui products, meditation materials, jewelry, CDs and books. When I was in they were offering Tarot card readings. I didn't get one done but I wish I would have. \n\nThe staff here is very friendly and knowledgable and the prices are reasonable. \n\nThey also have stamp cards where if you spend $25 you get a stamp, and 10 stamps means you get a free $20 purchase. Love it.\n\nOverall, if you're into new age, spiritualism, or just want a unique shopping experience, I recommend Ascendant Books.","date":"2014-04-12 22:29:01"}
{"review_id":"9RQT18uf01IG1_bzaYkUlg","user_id":"MsegHRYzZJxS-oeE3fO6jQ","business_id":"cLlBDZxYJ1dt1JgMuZnXew","stars":2.0,"useful":1,"funny":0,"cool":0,"text":"The only criticism is how staff clearly isn't accustomed to diversity. I walked in with my girlfriend, as she was sitting down I went to the bathroom and the bartender  immediately said \" we don't have a public bathroom\" and blocked the bathroom entrance. As a black woman, looking around everyone-- I had to tell him I'm eating here, and pointed to where my girlfriend was getting settled at the bar. He moved and changed his demeanor when he saw how offended I was that he did that. I'm sure that no one else had to explain they are a customer to go to the bathroom and it's unfortunate. I have never written a review but this needed one.","date":"2020-02-16 17:28:40"}
{"review_id":"jP7NHvzaqJ78p9DjkgUXyw","user_id":"K0W-4ZYX6a21xdB5Q1njMg","business_id":"pIY1UltfmUX--6yrAhg-mQ","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"We stopped in on a whim. There was one couple in the restaurant ahead of us. We ordered three steak sandwiches, fries, and a milkshake. The milkshake arrived first and was bland so we sent it back. A short time later the meal arrived. One steak sandwich was hot and the other two were warm. The fries were also just warm. We asked for fresh fries. By the time the hot fries arrived, we were halfway done with our sandwiches. The staff was friendly and apologetic. I can't imagine what it's like when they are busy. They also don't have highchairs so we were forced to go get our car seat. With a total of five people in the restaurant, they should be able to deliver hot food. We have no plans to return.","date":"2013-02-06 19:46:14"}
{"review_id":"nB44Q2SQGWOxr5I8D_reVQ","user_id":"0bB97VkdPlPhvajCTffgIQ","business_id":"IDtLPgUrqorrpqSLdfMhZQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"This place has a good selection of breakfast items. I stop by sometimes on my dog walk loop. The green eggs and ham sandwich is amazing. Pesto pairs nicely with everything on it but the best part of their sandwiches is the delicious biscuit it comes on. I also recommend the fried chicken sandwich. It can be kind of greasy but that helps hangovers (or so I've convinced myself). If you like a little kick in the morning, go for it! (Ask for extra napkins). Would give five stars but I got the impression the restaurant isn't as dog-friendly as other places around town.","date":"2021-02-05 22:32:41"}
{"review_id":"0Aui_DQrgdVeaW3OBk_X6Q","user_id":"LYb6flnUYbLMJmFeOjqZhA","business_id":"-c-Ic_5Mh_yi1Z4jbkc17A","stars":5.0,"useful":5,"funny":0,"cool":0,"text":"I have used them for a few years now. No issues and good communication. You need to read his blog daily to know when he's coming, in case you need to unlock your gate like I do. However, I enjoy reading the blog! I especially like that I can pay online.","date":"2018-01-19 15:52:57"}
{"review_id":"iyXM-Chv6TJ01y-7iqkz8Q","user_id":"bJgfxs6_h5Tcp5anvdTtYQ","business_id":"FnEkr6LzjuGsg93Z7fkl7Q","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"I like this location a lot more then the 1511 Locust Street location. Very spacious mixed crowd where you can see everyone at the bar and plenty of TV's. The menu is very large and they even offer Califlower (instead of macoroni) N' homemade Fondue cheese as a option for those being carb conscious.\n\nI went with the Oysters that normally are not brought in to the establisment until after 4pm but lucked out as they had these early in the day. The Oysters were quite small and not worth the price but I appreciate this bar offers them as a food option.\n\nFrench Onion Soup - Pretty banging cheese. I have had better French Onion Soups but enjoyed the soup and at $8 a cup that is the max I am willing to pay.\n\nMy overall impression of this Misconduct Tavern is it is a great bar to bring friends from out of town if you want to relax and enjoy yourself spending time catching up with a great variety of food options. That being said...it is slightly overpriced but directly adjacent from The Sterling (an extremely nice apartment complex) and if you have money to rent from The Sterling I do not think you will balk at the price points. I hope this bar is around a long time as I do enjoy it however.\n\nThere other location is much more dimly lit and too crowded. Only benefit of the locust location is there are many bars you can pop in and out after visiting the locust Misconduct Tavern. The one on JFK is pretty isolated but a few minutes walk and your be back to the bar scene of the city in no time.\n\nAs always people SYOY!!","date":"2020-03-15 19:24:52"}
{"review_id":"yLr8ql6zsCQ5e6pe7rr4fw","user_id":"gtmaVi9HuWe5vR6rLB2E8A","business_id":"gK9CdFaCXmHoW8aLfXiSqg","stars":5.0,"useful":4,"funny":0,"cool":2,"text":"I made it to Mecca!!! Never liked a saison until I had one here. I never liked an IPA until I had one here. The food is amazing, especially the ceviche. Try the candied bacon at the cafe. Just wonderful!  Loved the whisky pickle. Just an amazing borderline religious experience.","date":"2017-07-20 00:20:12"}
{"review_id":"1UQTPr9xaIuBLpAtZ4ISUw","user_id":"Y65-NKFszmQFr-Fcmgwwuw","business_id":"cOusUxMKRtYcsMS7pcCIKg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We just bought a vehicle from Southtown Chrysler. We were treated amazingly. Best sales man I've ever had to deal with. Thanks Kevin Sorochan.","date":"2019-05-04 18:08:07"}
{"review_id":"vMyqbdiCSh-w6_zfiowgiQ","user_id":"43pTJtTZA1qbsjeRWozYJQ","business_id":"hYonVJe6xzVBHHT2FLo4zg","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"As part of our quest to visit every new restaurant in Nashville before 2015, my girlfriend and I went to 312 for dinner on a Friday. It wasn't crowded and we were sat right away. Immediately, our server, Kayla, stopped by the table and got our drink orders. \n\nWe had Fried Mushrooms for our appetizers which come with a homemade ranch dipping sauce. These are easily the best fried mushrooms I have ever had in my entire life. The breading was crispy and the mushrooms inside were cooked all the way through, and were incredibly juicy. I don't know what they put in that batter, but holy cow. It was perfect. \n\nFor dinner, we had a deep dish Daley Supreme, which has Mushrooms, sausage, onions and peppers. It was amazing. It was so filling, neither of us could have more than one slice, but the leftovers made for a great breakfast the next morning. \n\nThe sauce is out of this world, so much so that I am kind of surprised at some of the reviews that have been critical of the sauce. It has the consistency of tomato paste but a very rich flavor that really ties the whole pie together. I have been to Chicago plenty of times and have a number of Chicago deep dish pizzas, and this pizza was FAR better than anything I ever had up there. Giordanos aint got nothin' on 312!\n\nOn top of the outstanding dinner, we had spectacular service. The server was on top of it, making sure our water glasses were always full and that our next beers were always ready when our glasses were empty. \n\nWe will definitely be going back.","date":"2014-10-12 18:16:00"}
{"review_id":"i6P_yCXVY0CzTXuzzU8Avg","user_id":"Hs7jwlDbPh0ufYd6woIy2w","business_id":"hS6KNGCQVTYUdLb2edt58g","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"My daughters and I did the jazz dinner cruise last night. The cruise itself was nice and informative. We learned some very interesting things about New Orleans such as it is six to eight feet below sea level! We were informed that this is the reason for the above ground cemeteries because if you dig down six feet, you'll hit water! So interesting! \n\nThe staff was very friendly! The lady who led us to our table from Gray Line was very upbeat and enthusiastic! I wish I could remember her name. Jamie, our waitress was also very nice. \n\nThe cruise itself was $48, with dinner,  $83 per adult. There was salad with a vinaigrette dressing already on the table, which was pretty tasty. The food was available buffet style. I chose the green beans almondine, creamed spinach, cajun pasta, prime rib, roasted pork loin, and chicken gumbo. \n\nThe reason for the two stars is the food. I was surprised at the poor quality. The green beans were tough and borderline stringy. The creamed spinach and the cajun pasta were bland. I'm wondering if they were from a can. The prime rib had a lot of gristle and the roasted pork loin was very dry. The chicken gumbo was unremarkable, to say the least. As for dessert, the bread pudding was inedible. Aside from the salad, the bananas foster was the only thing I enjoyed. \n\nAs much as I don't want to tell you what I was thinking about the food, I must because if you're like me, you depend upon Yelp to help with your choices. That said, the food reminded me of what would be served in a nursing home for a holiday meal.......no kidding. \n\nI wouldn't advise bringing children on this cruise as it was crowded and the rails are a bit lower than what I'm used to. My grandchildren are well behaved and I wouldn't bring them. \n\nI would highly recommend the cruise itself for the information, sightseeing, and live entertainment. Do yourself a favor, save yourself $35 and eat before you get on the cruise.","date":"2018-04-28 05:39:54"}
{"review_id":"aXwnQJPQzEfETNoUc3gAUg","user_id":"w1b4IqSgmtjeOTr-JngjoQ","business_id":"JI3-QZwm6vihIFBcekgyaA","stars":4.0,"useful":5,"funny":0,"cool":1,"text":"My friend and I stayed here a few months ago when we visited Edmonton for a concert. We were pleasantly surprised with the convenient location and the free parking! The hotel lobby is small but very cute and the friendly staff made for a quick check-in. One of the drivers gave us a ride to Rogers Place since we were running late and it was only a 10-15 minute walk to the hotel so we walked on the way back. \n\nThe room we were in was clean but on the smaller side. The only thing I had a problem with was the bathroom door. There was a sliding bathroom door that didn't even close properly. That's a little weird when you're sharing a room. I was going to request a different room (if they even had any with regular doors) but we figured we were barely spending any time in the room so it should be fine. \n\nThey also offered complimentary in room wi-fi. As well as complimentary breakfast which we didn't go to but that's always nice!","date":"2017-03-08 20:52:32"}
{"review_id":"s_uuZyfgVa-8-JKSoYQnZw","user_id":"3nnBsqqkXAVOOKMlq64CnA","business_id":"ELKgARoj5UNjQXUkX8T8KQ","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Kind of pricey compared to what I pay at my apt complex, and this other laundromat but it's worth it. Clean establishment, clean working washer and dryers. Overall, awesome laundromat. I went in on a Sunday in the late evening, and it was pretty busy but had no issues getting machines. Will be back!","date":"2018-11-05 20:35:21"}
{"review_id":"s3yJOsZ_Wxuz7old6ayjUg","user_id":"HgAPk3i7LBMXRu10i9CduQ","business_id":"6mnotS2bl54IN7ofeoJqgQ","stars":2.0,"useful":1,"funny":0,"cool":1,"text":"Service was fine, but the food was just OK. Chalk it up to personal preference maybe (because they have a lot of decent reviews from others) but I guess this place just isn't my style of Mexican food. It was, to me, bland and pretty flavorless. I ordered the small burrito (chicken) with enchilada combo, and a beef crispy taco on the side. None of the food I tried really made me go \"yum!\" I hate to give only two stars to a local business, but I won't be back; the food just wasn't something to get excited over. IMHO.","date":"2015-04-03 18:22:55"}
{"review_id":"QAXh0Cf5KYcSvNc6q7A7EQ","user_id":"jliRJEUK0CTsPT0APYEFOw","business_id":"TuRy46Cyb7MWjV7VM8VNYg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"I moved nearby and have been ordering from here fairly frequently.  The food is good and the menu is expansive.  Also, they are one of the few restaurants in the area that takes orders through Grub Hub.","date":"2015-02-06 23:15:28"}
{"review_id":"GpI28usKy7bjbrSCX2fO3A","user_id":"q6lGisF4V31XQPaLZbT2xg","business_id":"TLZ3-eDPLhUzfsWO4ad6Ug","stars":4.0,"useful":2,"funny":1,"cool":3,"text":"There are plenty of po boy places all over the city, and when you step into Mahony's, don't let the good decor, creative po boy offerings, or even the proximity to Bourbon Street fool you.\n\nThe clientele was very relaxed and calm, but not touristy. Our server Cookie was really sweet and made us feel right at home. We ended up ordering a few things. My mom ordered the Peacemaker dressed but without bacon, and I ordered the classic fried shrimp po boy, dressed except for tomato, along with fries (regular and sweet potato) and onion rings.\n\nFull disclosure, I arrived here with a full blown hangover (thank you Pat O'Brien's), and the po boy itself was enough to settle my stomach. The shrimp was crispy, and the crunchy bread and cool lettuce and pickle helped bring a little freshness and acidity to all the seafood. Fries, of course, were seasoned perfectly, and the onion rings, while the thin kind, were equally flavorful. \n\nYes, the price point is more like what you'd find in say, Hoboken, NJ (close to where I live). But overall, I was really satisfied with the meal and thought this wasn't a bad choice for a po boy fix.","date":"2020-02-02 19:09:38"}
{"review_id":"eE2xrWndV-mpSJWTqX4RFg","user_id":"21LR11L77FSfdWPP7k5gXA","business_id":"GBw_S68Hq-unyNCEjfi9RQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Sydnee was fantastic! It was the first time I had been in since I was a kid myself and I took my son in today. Sydnee was amazing with him, showed him how the stuffing machine worked and did the cutest little play through with the heart that got put in the doll. She even walked us parents through the entire process of helping him pick a name and print the \"birth certificate\". Next time I go in I hope she is there again!","date":"2019-12-02 03:49:12"}
{"review_id":"K6IcERnkbWMRkk9EzhQyyg","user_id":"Ezj6VXUalMVEEUSgTu150A","business_id":"CVsLAzbSEfVgDSnSslwJqA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Ordered for takeout.  We had two items - Tonkotsu ramen with pork shoulder and spicy miso ramen also with pork shoulder.  Tasted good and very reasonably prized.","date":"2021-11-21 23:14:05"}
{"review_id":"GoSlHcAKjSIuIZd504ke5Q","user_id":"IChJkuIx5aOSpVgxvtNOoQ","business_id":"IAyHcNx5IHoLf3V4dlgFCw","stars":1.0,"useful":2,"funny":1,"cool":0,"text":"I went to Pagoda Noodle Cafe with four other women after a great time at the July concert and fireworks on Penn's Landing.  When we walked in we were asked, \"How many?\" I said: \"Five.\"  As we were being led to our tables, one of the women with us asked if we could sit at a round table that we just walked past.  They obliged.  I wasn't feeling well, so I asked the gentleman seating us for Chinese tea.  He said ok and left.\n\nThen another person came to serve us.  She asked if we were ready to order.  I sensed an attitude from her right away.  Nonetheless, I place my order, which was for Chinese tea, as that's all I was planning to have.\n\nThe other women with me were still looking at the menus, but went ahead and placed their drink orders.  The server then appeared agitated.  As she was walking away to get our drinks, I asked if there was a problem (remember, I'm not feeling well, so I'm not putting a lot of energy or neck movements into my question).  She said, \"I asked if y'all were ready!\"  You see, she wanted to take our *entree* orders, not our drink orders.  That's what she meant by \"ready.\"  When we only gave her our drink orders, it frustrated her and she let us know with her poor attitude. \n\nNow, I can take attitude from anyone, but any restaurant has a choice to make:  They can either give me attitude or take my money.  But not both, and not at the same time.\n\nSo we left.","date":"2013-07-17 16:12:40"}
{"review_id":"03FRQ1fxdzMpLedQLmhaYg","user_id":"aqeHdulu7CwWzvgZVgHZTA","business_id":"FoIKunXAHONBK5VpL_4dQw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Went back to JDA a little less then two years after purchasing my 2011 Mitsubishi Outlander. Had a really good experience. The second experience wasn't good at all. The lied to get me to come in said all the paper work was done on a car I didn't want and I was asked \"if I could live with it\" by the sales manager Steve. The prices are high here compared to Car guru. I left there mad and drove 11 mins to Del Toyota and bought a Highlander! Wow the people were outstanding to deal with.","date":"2018-01-03 01:43:37"}
{"review_id":"3_bFgIcmv66uVwYi8hVRZQ","user_id":"SZH4xUb8l692z0cWzwYvwQ","business_id":"2FnoLyEO0nq7g2Wz8x7Z5A","stars":1.0,"useful":4,"funny":1,"cool":0,"text":"Aweful. I got the garlic chicken. It was luke warm, noodle were under cooked. I couldn't eat it. Had to get a refund. If you want real stir fry, try an actual asian restaurant.","date":"2015-01-13 18:15:00"}
{"review_id":"kYc0IXcs4T8imSEh34WxrA","user_id":"_ibPrSYS_K7qY-c5wfHWcg","business_id":"-kGUmgyeYcNDcuEr4FoVeA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The pizza was so round and filled with so many savory flavors. It was spicy in all the right ways, I order the wild wings pizza every time. My old lady got the Pah rah pork barbecue sandwich which the size of the meat surprised her, she could barely stuff it in her mouth.  Next our eyes meet, my face is covered with spicy wild wings sauce her mouth dripping with barbecue sauce. This lunch time meal ended with a cigarette and a nap.","date":"2015-06-29 02:10:32"}
{"review_id":"T-uvXySKRdxTQrSfGOtaIw","user_id":"n2zng-qdlx--rzHc0nD4hQ","business_id":"dJUXONEvGDoxM3EPTzfY7g","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"I'd say the best fried rice in North County. I love the other sides they have as well.","date":"2018-06-25 20:31:57"}
{"review_id":"yMoP6DtbjUENu00QiZKj6w","user_id":"eLocyu86Ej-C8ati2vofcA","business_id":"K8b2MQ5Az59-nzvqUfjJEQ","stars":3.0,"useful":0,"funny":1,"cool":0,"text":"If the service was better this would be a 4 star review. The meal began with some rolls (Parker House style) that were boring.  The restaurant made butter, fortunately, was quite good and enlivened the bland rolls.   \n\nThe spring salad had a lively assortment of fresh greens served over a schmear of creme fraiche.  Too bad there was a little more so you could taste a ramp and such more than once.  The mackrel appetizer was very well prepared, seared on one side and served with juicy, sweet grapefruit.  That was a hit.  The one very annoying component of these two dishes was the ridiculously large plates on which they were served.  The plates would have been appropriate for a individual pizza, but not a small fistful of fresh greens. \n\nThe \"mains\" of pork belly and loin with mustard greens and spaetzel, and hanger steak, were both excellently prepared.  The steak was perfectly seared and the vegetables crisp and delicious.  The spaetzel had an interesting flavor and provided a good texture to compliment the mustard greens.  Both of these dishes were spot on and demonstrated talent in the kitchen.","date":"2011-04-23 23:09:15"}
{"review_id":"u58BlDrAs_WsmAZcgE8bbw","user_id":"gLOMN5hryaaL3BZxRiWcLA","business_id":"mcwiecpP3n5ED-8xKF5_1A","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"I stopped by Popeyes in Brentwood today to pick up some chicken to go. I walked in the front door and was greeted by the woman behind the counter yelling \"were closed.. \" I looked confused because the door was unlocked and there were people there working. The manager was by the door and said it was ok for me to stay and that the men's toilet was broken and the dining room was closed so they were doing the drive through. I assured him that I only wanted to carry out only but he said I could go ahead and order inside even though I offered to go thru the drive. He disappeared and I stood at the counter waiting to order for several minutes. The people at the counter did not offer to take my order but instead ignored me while they waited on people in the drive through even though I was there first. After several minutes of waiting I got in my car to go through the drive through to get my food only to find the speaker st the drive through also broken. When I ordered at the window the woman was less than friendly. She yelled at me from across the restaurant that they only had thighs and breasts.. I said it was ok. She hands me my bag of food after I paid and the box was not even shut. The chicken, sides and biscuits had fallen out into the bag. When I asked for utensils she scowled at me and handed me 2 sporks. This whole experience rates as one of the worst I have had in a long time. I tried to rate them in the Popeyes web site but you need the store number to do so and that conveniently is missing from my receipt. I wonder why???","date":"2019-09-16 21:27:25"}
{"review_id":"smVhwg5zgp8RBA-7ae-Wqw","user_id":"kmyO80BMdVGG3kJpr_fymA","business_id":"dNR-b-CsrFGYhMo9zLMrCw","stars":4.0,"useful":1,"funny":1,"cool":1,"text":"Let me start off by saying that I love this place. We dropped by here yesterday.  I always get the Bibimap and they make a delicious one with brown rice.  Only complaint is the very small amount of meat they give you with it.   If they fix that then they will have the best Bibimap in the city in my books.","date":"2015-06-24 15:50:31"}
{"review_id":"uymAiIQgXqCaYsmr4DuH2A","user_id":"R8hlGXzMzCJ_cqiS7Wy0gQ","business_id":"8QJTzIaR5FceGds8HBSIig","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Good brews awesome food and the building is very old which is awesome. Must check this place out.","date":"2021-08-06 00:11:05"}
{"review_id":"JZDDXlmPlZSfh6gxRXWfmQ","user_id":"x16-43oo4hf_R6ZI2Ykn7A","business_id":"htO_nlxkEsYHzDrtbiUxew","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"I'm not a coffee drinker, but this place has some good coffee. I got some tea here as well, which came at the recommendation of the guy behind the counter and it was good too. Beverages were in nicely designed cups and saucers. Expect crowds.","date":"2015-01-02 20:41:08"}
{"review_id":"WN31vzz-ta5qHAyOSJguMw","user_id":"SeHCgDpSzPhPO2BsqdW1rg","business_id":"xsTiT3S9J87uYB1P8DHLgQ","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"I've heard great things about The Studio and finally got a chance to check it out today. \n\nI love The Studio's cozy vibe. The warm, dimly-lit becouched lobby feels like you're walking into your hippie friend's house, not a business. It's inviting and comfortable. I settled right in and felt at home. \n\nThe owner, Rachelle, is down to earth and friendly. Her wonderful, well-behaved, and charming pit bull \"Chevy\" can be found roaming the area and distributing genuine affection to any humans in a five-foot radius. More business owners should bring their pooches to work -- it puts a smile on my face. \n\nThe class I took was for beginners. It was held in a pleasantly-trapezoidally-shaped room. The class focused on flexibility and calmness. The only thing I didn't like about the room is that it didn't have mirrors on the walls. I use mirrors to make sure my form is good and to keep my balance during the more athletic poses. I am not sure if their other yoga rooms have mirrors, but that's just my preference. \n\nI had some neck pain when I woke up this morning; I must have slept in a strange position and pinched a nerve. After the class, my neck didn't hurt any more! I walked out of the class feeling refreshed and pain-free. I'll be back for sure!","date":"2014-03-24 01:18:36"}
{"review_id":"cN-MA3tFInP_1-SnTBYazg","user_id":"KmAnCx4Yu7cgLYbDUAhAxg","business_id":"U3WKSiu7OquPEnRuEchthQ","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"It was clean, server was great.  I ordered a Pizza Flatbread, it was very under cooked doughy took it home and decided to throw it away.  Also we got the Broiled Seafood platter,  it had too much lemon flavor.   Hopefully they get somebody to quality control the food before it leaves the kitchen.  I will give them a few months and go back for another Dinner hopefully it improves.","date":"2017-07-17 16:43:34"}
{"review_id":"oqva2Cet3LhXFpW4IJNf9A","user_id":"mkkWFvsuqYWnizVeBqBXQw","business_id":"hYonVJe6xzVBHHT2FLo4zg","stars":2.0,"useful":1,"funny":1,"cool":0,"text":"Pizza is good but not worth the terribly slow service. Sat at our table for 10 minutes and never was greeted, despite servers standing feet away staring at us.","date":"2017-05-12 00:39:28"}
{"review_id":"fmaR6IarT4C0vbruE7frWA","user_id":"MDV8a8iylsig9_-ORXNJcQ","business_id":"BtXfGowX6kupvO-TCyvb4w","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Great service. It was my first time at this place. The cashier and the folks helping to clean the car were friendly, thorough and quick. The reason they got 4 instead of 5 stars is because they didn't wipe down the door jambs.","date":"2016-06-19 17:26:53"}
{"review_id":"RLujtwSvLr8ulST9-8yA2A","user_id":"toPyPzjnCTpsZLkFdmkt8A","business_id":"Sywhp4jHJnNIRtqJi1slSQ","stars":1.0,"useful":7,"funny":0,"cool":0,"text":"I don't understand why the owner and staff are refusing to wear a mask and protect the community. Social distancing was non existent. Took my business to Ace Hardware in Harleysville.","date":"2020-08-08 23:01:33"}
{"review_id":"IuWzlOOkqQ6akbnazqUbQQ","user_id":"UjWnklyLXR__pQ-g2vsbKA","business_id":"cbkrO0zra1OiNGvtjw2igQ","stars":1.0,"useful":5,"funny":2,"cool":2,"text":"Absolutely WORST! Terrible Service. Owner hangs up on customer. \n\nWow, as a senior at UCSB I've never been to any business as bad as this. I ordered three entrees for take out but they only gave me two. I didn't notice until I was home. I called them back to ask for a refund, and they told me I have to come back with the food to get a refund? Which makes no sense because anyone who would be lying about this in the first place wouldn't bring back the entree. \n\nI asked them how we can resolve the issue, and then she hung up. This place is a joke. Stay away. TERRRIBLEEEEEEEE\n\nI wouldn't go there if Wok on the shit side was the last place on earth. I would rather munch on grass on the side of the road. Once AGAIN. TERRRRIBLE!!!!! \n\n\nSTAY AWAY STAY AWAY STAY AWAY","date":"2015-02-28 02:19:46"}
{"review_id":"hNIs8eDyf85F3ErVgxk9Zg","user_id":"0j_3crr9eXz3vTR5QrB7Bg","business_id":"MMRRS6YhVRx_iN5-JhMRYg","stars":5.0,"useful":1,"funny":0,"cool":2,"text":"I had a professional meetup at Han Dynasty- Univeristy City. We were a group of 11 people, and we met at noon on a Saturday. Our table was ready for us when we showed up. We sat on one of the round tables in the back. The table was big but we could still hear each other especially that the music was low so that was definitely a plus! We didn't really do the family style ordering because so many of us but I still had the chance to taste the following: spring rolls, beef Lo Mein, chicken crispy rice style, tofu dry pepper style. Everything was great! My favorite was the beef Lo mein- so good! The waitress was very attentive as well.","date":"2019-03-04 17:57:50"}
{"review_id":"Wwwluwypiy_Ulr9o9-LNvQ","user_id":"vndJmanpPhzKRdDztWSxDw","business_id":"j8JOZvfeHEfUWq3gEz6ABQ","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"This place is so cool! I was visiting NOLA from out of town, and one of my friends who lives here took me here for dinner. The ambience is what really makes this place; it feels like you're in someone's backyard with live music and pretty lights.\n\nWhat I like most is that you can pick out a bottle of wine and some cheese from inside and they'll plate the cheese for you and bring it out to you with some bread, jams, nuts, and pickles. They have buckets for you to fill with ice for your wine and you pick up glasses for yourself as well. This place is super self-serve!\n\nThere's also a window to order hot food that they deliver to you as well. You just take the number and tell them if you're sitting upstairs or downstairs and the bring everything to you. The portions aren't too huge, so it's fine to get a bottle of wine with a couple of cheeses to share with friends and also order an entree for yourself from the window.\n\nI went on a Friday night and it was really busy (apparently live music starts at 6?), so we couldn't get a table downstairs. There's standing area at the balcony upstairs where you can still hear the band (but you can't see anything, there are too many trees and things in the way). Afterwards we headed inside the upstairs area where there's a full bar and lots of tables and things for you to chill at.\n\nAll in all the ambience is amazing and I love the pick-your-own wine and cheese combination part!","date":"2015-09-02 05:34:33"}
{"review_id":"UOOoaIEINIRCi5ZvN3doXg","user_id":"j9Z1dcoZrwn8Ul9JTnjjug","business_id":"EDjEVzmoQVHzboFqC-M6Ew","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Okay. Second try. First try I checked in because I was here but we didn't order anything cause it was bumping on a Friday night and we needed to get somewhere for that night. Saturday night. Still bumping. This has to be good... It has to live up to its hype.\n\nSo the question you're all wondering.. Was it worth the hype? In all honesty, it was okay. Walking in, the line situation was something that's really noticeable. At first you think it's because this place is amazing, then once you pass those second pair of doors, you know why it goes out the door. The counter where you order is right next to the door. I think they could have planned that out a little better, or at least place the register somewhere else so it doesn't get in the way of just people waiting in line or people going in and out to serve people. \n\nAnyways, enough about the hype-ness. What's up with the food? I ordered I believe 4 or 5 tacos. The ones that stood out in my mouth was the Southern Fried Taco.\n\nWhich tacos did I order?\nSouthern Fried Taco\nKorean BBQ Taco\nSmoked Brisket\nI believe the Local BBQ\nI want to say the Tequila Lime Chicken Taco, but I can't be positive.\n\nI know, I know. You're probably wondering why I'm even writing this if I don't even remember exactly what I ate. It's because they weren't all that great... Nothing really stood out in my mind except the Southern Fried Taco. So, my advice: If you're going to order any taco, get that one. The other ones weren't that amazing. The Korean BBQ taco, I ate about half of it before I got the taste of the BBQ part. Also, I don't think there was just enough meat in the taco itself. \n\nThere's a lot of seating. Indoor and outdoor. Well, indoor during winter is going to be limited, however, the seating outside is under a canopy. So it's not the best place to sit as far as insulation wise, but it's still a place to sit if it's needed.\n\nAll in all, it's alright. I enjoyed the food, mostly. But the one piece of advice from me if you do come here to eat, get the Southern Fried Taco. You won't be disappointed.","date":"2016-01-07 19:29:02"}
{"review_id":"dpcbEOrzpB-IQVulGB2jbQ","user_id":"TIH7NflF03oe2OX44d773w","business_id":"TV81bpCQ6p6o4Hau5hk-zw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Almost always eat at Hellas when in Tarpon Springs. Warning - the bakery is irresistable!","date":"2019-11-07 03:14:42"}
{"review_id":"6S8GMF5YXy4eGEIqLlbleQ","user_id":"LzREHKoHwt6d3UQxl3_AeQ","business_id":"9OG5YkX1g2GReZM0AskizA","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"Well it's good thing for this place that it's Christmas and every place is busy lunch was lack luster salad not dressed croutons stale wait staff slow asked for stuff like balsamic vinaigrette none came never came back to ask how\nEverything was I asked for chicken on my pasta no chicken told him forget it since I was so starved my fault skipped breakfast won't come back unless it's a family thing and I don't get a say I don't like to give bad reviews I know that waiting tables is hard I have done it but this lunch sucked it wasn't busy enough to justify crap service","date":"2015-12-21 21:35:54"}
{"review_id":"hYk31hSiS-zxDfCAJZAtow","user_id":"OyLwmYN5liT9D1DsvljJgw","business_id":"qAnKc-pentc9UUQvtUYNew","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"I went to this clinic today and had wonderful service and everyone was very cheerful and helpful.  Even though there were five people ahead of me I was in and out in 40 minutes!","date":"2016-02-28 17:09:16"}
{"review_id":"OC9NsyTNNvD18Wqj53gOBg","user_id":"gmeZZzaoH7CTeIy6SKL9JA","business_id":"QUnvoceeKLK201dOflQThA","stars":4.0,"useful":2,"funny":0,"cool":4,"text":"Did you grow up eating ridiculously sweet and chunky snow cones?  Yeah, me too.  I think that it's safe to say that Pandora's snow balls are way better than snow cones. The ice is smooth and creamy, and there are a million and one flavors (regular, cream, sugar free) to choose from.  Pandora's is fun and you would never have to order the same thing twice unless you wanted to. They even have condensed milk as a topping in case you're feeling brave.  I got a small stuffed snowball: wedding cake flavor with vanilla soft-serve in the middle.  If you don't love really sweet desserts, then you might want to ask for light syrup.  At just over $2, I can't think of a better way to cool down on a hot day.","date":"2011-05-18 16:01:14"}
{"review_id":"4AwoDaB8VEHqqML5cZLDEg","user_id":"JOBjqBoJDELwzvzogq1YyA","business_id":"3y61A28PQDZ4weeeTRfIlA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Very underwhelming experience Friday evening.  Decided to stop in while walking by because I had read some articles about the place and understood there to be a connection to St. Elmo's, so my expectations were high.   There was a major conference in town so I will preface my review by saying we sat at the bar, but that's not much of an excuse.  \n\nBartenders were friendly but the primary one taking care of us was too busy while her counterparts seemed to have spare cycles.   I don't think she was as good as she thought she was at juggling so many balls.   She took my drink order while filling another big order.  5-10 minutes later one of the other bartenders asked my wife if she knew what cocktail she wanted.  My wife got her drink immediately and I waited another 5 minutes.  \n\nI ordered the Prime Degree and I think my wife had the Homecoming.   We both ordered ours Medium.  The burgers were very good.  However, mine was cooked Medium Well+.   I got an \"oh so sorry about that\" from the bartender.   My wife agreed there was no discernible taste in beef between hers and mine (dry aged).   Mine was definitely not worth $19.    My wife ordered her mayo on the side and did not receive it.   \n\nI had a Stout on draft for my next drink and immediately regretted placing the order with the primary bartender taking care of us.  Once again one of the other less busy bartenders came by a minute later to ask if I needed another drink and I'm confident I would've received it much sooner.    Rather than spend any more money at the bar here we took off without ordering more.  \n\nUnderwhelmed is the best way to describe our experience.  If the place is going to play off the St. Elmo's connection, and charge $19 for a burger, then it is not unreasonable to expect an experience more in line with the quality of service one receives at St. Elmo or Harry and Izzy's.","date":"2018-06-24 14:27:21"}
{"review_id":"qereXTabSVf2lafDub8cfw","user_id":"AFKXXZJL9Bdu8Km7I7dBRw","business_id":"ujN8QWiLDqNhcu4LQ3f3nQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I think I spoke to every employee by the end of my car hunt and each one was excellent. Angel (sales), Tom (finance), and Brianna (finance) helped my to get into the car I wanted by allowing me time to make a smart decision rather than any pushy sales tactics. As a first time buyer not once was I asked \"what can I do to sell it to you today?\" I told them I wanted to discuss it with my Father and they invited me to do so! Great people that I will surely return to in the future and highly recommend!","date":"2017-09-20 14:42:17"}
{"review_id":"j1jkt6bOpun6WyuoIf58fg","user_id":"nPJw7YpKgHE6fowxgl3l1A","business_id":"xruWHK8Z5N0JWyQubLHjgA","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"this is going to be short and sweet...\n\nthe best cannoli i've ever eaten","date":"2013-01-31 22:59:46"}
{"review_id":"C1YIF6AFlby1Qiu-xBF7bA","user_id":"rTKK_-3W3gIQEohj0QSFWA","business_id":"tH10ZuH28GrccqTZ6TTl7A","stars":4.0,"useful":4,"funny":0,"cool":0,"text":"Last winter I sailed on the Carnival Legend departing Tampa, FL for a 7 day western caribbean cruise, it just so happened that my cruise departed Tampa the day of the Superbowl, but I was able to catch the game in the theater.\n\nOverall I picked this cruise for the ports, Cozumel, Grand Cayman, Belize, and Roatan. This was possibly the best mix of tropical and beach ports, I don't think I could have asked for anything better. \n\nFirst off, the ship hadn't yet been renovated (I think its due for dry dock this year) but the inside wasn't bad. The Legend isn't a small ship, it actually fits in someplace in the middle. Overall the cruise was great, enjoyed my meals, and time on the ship was great. However I have to admit the real reason was the ports.\n\nMy first stop was Grand Cayman, which I took a tour of the island. Overall the tour wasn't bad, but the highlight was the turtle farm. It was amazing, I really enjoyed seeing the sea turtles there was something really fun about it.\n\nSecond stop was Cozumel, which included an excursion to Isla Passion, which is a private beach\/nature reserve with an open bar and buffet and all water activities included. It looked like something out of a Corona commercial, amazing.\n\nMy third stop was in Belize, and a tour to the ancient Mayan ruins of Xunatuinch. This excursion was about a hour bus ride across the country, close to the Guatemala border. The country is beautiful, and the drive was actually very enjoyable, however the real highlight was the ruins, simply amazing. The tour was rich with history and from the top of the ruins you could see the town of San Ignacio, the tropical rain forests, and Guatemala. Loved it.\n\nThe last stop was in Roatan, Honduras, here we opted for a casual tour of the island however I think another beach day would have been just as good. If you are into scuba diving this is a great place for you.  Overall the island is very beautiful and offers some great scenery.\n\nI enjoyed my cruise, and wouldn't mind consider sailing on Carnival again. The service was better than I had expected after talking with several friends. I almost forgot, Cynthia, a casino bartender actually made my trip so much more enjoyable, she was a pleasure to talk with and made a mean drink.","date":"2013-01-15 00:42:13"}
{"review_id":"ezlHA0qfSFnppj7mg5pwhw","user_id":"ZAOR_q28NMOrsJ8_pKh89A","business_id":"pafrjSu3h0v0N8GR3ghNtQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Yats is the NUMBER ONE PLACE i miss the MOST of ANYTHING in Indy. damn....how can i have moved to the south and not find decent creole?!!?\n\nspinach mushroom etoufee. NUMBER ONE. nomnomnom. i don't know what the orange butter they put on the bread is but OMG. so tasty (and probably bad for me).\n\nhowever, Joe (the owner) is AMAZING. super nice, polite, accommodating back in 2003, i went in with my sister and my brother, who is disabled (wheel chair disabled). it was March and pretty cold outside. there weren't any seats inside so we sat outside. Joe saw us and was really upset that there weren't any seats available for a wheelchair. so he comped our next meal (which delighted my brother to NO END). \n\nJoe knows the important people. Us who order extra bread with extra orange butter. He's a bit crazy, a bit eccentric but AMAZING. above and beyond what you expect out of a local place. (he also goes across the street to Moe and Johnny's to \"steal\" what he needs. which is an amazing length to go to to make sure your customers are happy!!!).","date":"2013-04-09 03:04:08"}
{"review_id":"LySU_Z6WdJetbwut-rv9Qw","user_id":"wdAEc4Z0IOnESdNBfwvoQw","business_id":"18eWJFJbXyR9j_5xfcRLYA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Thank you Siam Elephant for always having great food and wonderful service. My favorite restaurant in town.","date":"2020-09-05 15:44:52"}
{"review_id":"7b1l1Twkkq3VeJble7ek3w","user_id":"cJKkikVhEODxtdCmZKYZ9w","business_id":"gC8i-lxwvGhVpOXM5eYdtA","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Y'all, this is the most legit mexican food you'll get in NOLA and for a good price! I grew up in Phoenix with a Mexican momma and I have been searching for authentic food.  This is as close as it gets down here!  The tacos are bomb, the flautas are great, mole is decent, POZOLE IS TO DIE FOR ON THURSDAYS!  Really affordable and the most legit mex food around.  I always get the Jamaica with my order, but you can also BYOB for no extra fee. Service is great, place is clean. Some tasty nieve up at the front.  I really can't complain.  Get the barbacoa or even the chorizo for some extra good food.","date":"2016-02-12 22:44:17"}
{"review_id":"a91rXgjl5xpSdESZSVErvA","user_id":"a2GspWk2maHvXioTUugCZg","business_id":"NT5S6JV5wPwKOd3s3Yh1zQ","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"I love a good foodie burger spot that makes delicious burgers with some extra attention to detail.  This is not such a place.  The decor suggests that it is, the hipster staff suggests that it is, but the food is poor.  The  burgers are made with low quality meat, and they are over-cooked, dry, and tasteless, and WAY overpriced.  The bread is kind of icky and the fries are soggy.  I have been to Burger Up multiple times, and since I really wanted an indulgent local burger spot, I kept giving them another chance.  Maybe they used to be good at some point and they've slipped in recent years, I don't know, but I won't be returning.","date":"2013-10-11 00:22:58"}
{"review_id":"dWtXhg9cOvJuFR7QP5d3wA","user_id":"QsRGofEVz_JQG_Kkrd0Wpg","business_id":"yQjEjXR3E_9bLTK-Xj07FA","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"My husband, three grown kids and I went here for the first time on a Saturday late afternoon in June. All of the outdoor seating was occupied so we sat indoors.  Because it was our first time here, it was a bit confusing trying to figure out whether or not there was waitress service (there was not at that time but a waitress arrived sometime later.).  There are also two bars and you cannot get the beers that they offer at both of them.  Some of the beers they offer can be purchased at the one bar. The other bar has a small selection of draft beers that they brew along with a limited menu. The food is quite delicious and much of it is sourced locally. The beer is exceptionally good as well!  Until a waitress was available for our table, there was quite a bit of getting up-and-down to order additional beers and food.  Adequate staff would be a definite plus. Most of the customers appeared to be regulars who know the routine. Supervised children are welcome.  Everyone appeared to be thoroughly enjoying themselves.  We are definitely going to  return, especially on Sunday when you can bring your own food and enjoy a couple of mugs of their really good beer.","date":"2017-07-14 21:43:18"}
{"review_id":"8cTJf1cuWbN0K4IAkk0iyg","user_id":"Ts2csy8E6S216Z7XHZWkVg","business_id":"Oun4NN-u5yiHIxDqtJnxgA","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"5 stars for the donuts, 3 stars for the chicken.\n\nWent at 9 AM on a Sunday, got 1 fig-on-fig, 1 indian cinnamon, and 1 strawberry rhubarb donut.  The indian cinnamon was 1 of 3 donuts they make hot upon request, the other 2 were part of the pre made batch that runs out eventually.\n\nThe hot donut was one of my favorite cake donuts ever -- moist, tasty, and the indian cinnamon spice complemented the donut flavor well.  The fig-on-fig had a good subtle fig flavor.  The strawberry rhubarb was good but a bit sweet for my taste.\n\nReturned at 11:45, got a number and waited until 12:20 for my half order of fried chicken with Zatar spice. The spices were ok but the  chicken was dry. Compared to other fried chicken this one ranks medium-low on taste and high on hype.\n\nThe staff here is really nice, crazy efficient.  They manage to stay calm and keep lines moving amid the donut\/chicken frenzy. Also while waiting for chicken they handed out hot donut samples.\n\nWould recommend the donuts, skip the fried chicken.","date":"2012-07-30 19:40:10"}
{"review_id":"yPv-6xmi_Gz93JpWozIQ-w","user_id":"gogtNfKhmG73yZKwuU0hzw","business_id":"EQ-TZ2eeD_E0BHuvoaeG5Q","stars":1.0,"useful":9,"funny":1,"cool":1,"text":"Definitely underwhelmed with the Milktooth brunch. Veggie options? \"Oh the waffle is great\" says the waitress. She must have forgotten about the crumbled bacon on top of the waffle.  Speaking of bacon, the side of \"bacon\" was actually a slab of fat. Yes, I know what pork belly is, this was still a slab of fat. Otherwise, the facility is great and everyone was friendly. Hopefully they get the kinks in the food worked out soon.","date":"2014-10-25 16:48:32"}
{"review_id":"D7XX8ISM9UbQCyBs7jA4Gg","user_id":"dyp45uOljFK7f1Izu5Lhgw","business_id":"QjKVhT6W04-HiDy6XCvn1A","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Overall, decent food. I was expecting a little more out of Jon Smith Subs, but not to bad given the price.","date":"2020-12-01 23:01:27"}
{"review_id":"-Cp2fuvULuGF3_yqlOh49w","user_id":"dheejEAu6YHWvyVVVNIktA","business_id":"Sm-0cEI-3NmuKaEKP6DX8A","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I love the trails at Blueberry Hill! Easy to access, clean scenic and in the summer there is an abundance of blueberries if you get there as they ripen!!","date":"2019-03-04 22:08:24"}
{"review_id":"h5jZFJraIhNMFEn3PE2qUw","user_id":"Qaor3hx9L4cPLsZl_YheCA","business_id":"7fETFidBtAZuWKanTfa02w","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"The staff was really nice, our room was not bad for an older hotel. It was clean and that's a bonus. The only downside about our visit was our key didn't work and after visiting the desk for a forth time they found that the only other way to get in the room was with the actual key. The bad part is 1) The management decided that no keys would be left there for the staff topped doors and they need too call her. It was midnight and took her 30-40 mins to get onsite. 2) While waiting on this manager I was having an asthma attack and my inhaler was in the room with no way to get in until she drove back. \nThis could have been a lot worse situation.","date":"2019-01-01 17:56:32"}
{"review_id":"ZXKrkKqd5p-z4_-HrBh3DA","user_id":"h9Mwu6SwOupjkOaztWKu9w","business_id":"Y_XyeCu8AkZyhcF0q5n8Dg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Wonderful people! Delicious and fresh food and the peach smoothie is sooo good. I would highly recommended it to anyone who wants fresh food instead of fast food.","date":"2019-03-06 23:57:39"}
{"review_id":"LsFtm5zGFKHRVqKYZcPzAA","user_id":"W6_SmzXpwIkFZBg9LklKBg","business_id":"-1MhPXk1FglglUAmuPLIGg","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"This is an easy place to love. The burgers are great, the service is very friendly and welcoming (they say hello and bye without it sounding like they are being watched and forced to according to a \"greeting policy\"). My wife and I are in our late 30s and stop in at least once a week after work. The prices are very reasonable and there is plenty of parking. I would love to see more green salad\/healthy choices on the menu but hey it is bar food! If I need upscale I can always go to the B-Line on 4th.","date":"2010-05-19 06:20:38"}
{"review_id":"S_HK6llUu6PHWtUDMNZWZg","user_id":"Zp1Qts56HfpyShMqjNepgw","business_id":"ZY2feSm2sc5nTXYHnKpMGQ","stars":3.0,"useful":1,"funny":0,"cool":0,"text":"We were too tired from sightseeing to go back out.  We decided to give Vitascope a try.  We started with the chips you get free for checking in.  The barbecue was the best.  We ordered drinks.  The margarita was \"okay\" and the Pama Punch was very good.  We split a pepperoni pizza.  Good; not great.  We opted to share a dessert.  We ordered the White Chocolate Hazelnut Bread Pudding.  That was pretty good!  We polished it off despite being full!\nAll on all....a good place to eat when  you are too tired to go far!","date":"2016-05-10 01:09:05"}
{"review_id":"2O7keRLuKhOZ3fiTHMpKHw","user_id":"-0rW5xrSCH1HCnSEmoQA5A","business_id":"SPfdgCODDJE1zTj5fACOGw","stars":2.0,"useful":1,"funny":0,"cool":0,"text":"The wife and I went to Bully's on Memorial Day around 5:00 and there was hardly anyone there. The wife ordered the pork steak sandwich and I had the pork steak dinner. I knew when they set the food on the table and saw my pork steak something was wrong! The pork steak was thin, small and it looked like they took a spoon and smeared the sauce on. I always have just used a fork to cut it but it was tough. The taste wasn't bad but I was truly surprised they brought it out! I've been going to Bully's since it opened and always had a great pork steak and sides. I hope that this was just a bad day and the food gets better. The wife's pork steak was tough also. The waiter comped our meal and apologized! I definitely will return to see if Bully's porksteaks are any better in the near future!!","date":"2018-05-31 00:14:58"}
{"review_id":"Y74RLCSbCYRCMnKAA_2fAw","user_id":"3hdRYyjmlopqmlXN0GA_YA","business_id":"HCqmx4ENAZ76SAjoalj-MQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great place in downtown Franklin to go for some nightly entertainment and great food. The bands are very entertaining. And always a joy with the crowd. TV with the sports games on if you're not into the song, which hardly ever occurs. Great place for southern hospitality. Would recommend to anyone I know.","date":"2014-11-01 01:38:14"}
{"review_id":"JDdS_StTPv2a5ocMkI62gQ","user_id":"dnjGJvlXzfuqA6AQDu6QVw","business_id":"bdfZdB2MTXlT6-RBjSIpQg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Came here to recover after Deltopia. The service and food were on point, even though this place gets a bad rep as people claim that it isn't authentic Vietnamese food, I would have to disagree (seeing that the cook was Vietnamese.) Living in IV means rarely being able to find authentic Asian food so if the drive to Noodle City is too far, try out Pho Bistro!","date":"2015-04-13 01:29:26"}
{"review_id":"3WmQjjtlqqI4MdjdVmtClQ","user_id":"b0zgSrXBDq8hsamvmjqEqA","business_id":"n5P6-HWN3kFSYBxfVfDxEg","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"Eat outside in the bar area. \n\nThe buffet was terrible. If you like quantity and not quality, this place is for you. If you want something with flavor, don't eat at Shephards. None of the food was good and it's really expensive. Low quality buffet food for $25 a person! \n\nThe location is great and so is the outside bar.  That's what the 2 stars are for.  They have live music and events so I'm sure it's a fun place if you want to party.  Just don't eat in the main dining area. Stay outside and order off the bar menu. TRUST ME!","date":"2011-06-07 20:54:47"}
{"review_id":"AQE9YmhBaErp4-MjXq-1Yg","user_id":"ZTxJh-CC9kZDDIWqzacG7w","business_id":"MMRRS6YhVRx_iN5-JhMRYg","stars":4.0,"useful":0,"funny":0,"cool":1,"text":"Had lunch here today. I live just a few blocks away, but had never come in. I thought from the look of the outside that it was going to be a PF Changs kind of deal, which is a big NOPE for me. If that's your bag, cool, but I prefer more authentic when I can get it. However, at the voice of a friend, I decided to give it a try. \n\nI got the pork belly double-cooked style, and the taiwanese sausage. The sausage is pretty much exactly what you'd expect, the sweet sausage that you find at Asian groceries, but paired with freshly sliced garlic which took it to another level.\n\nThe pork belly was a little drier than I expected. It didn't have exactly the melt in my mouth texture that I tend to associate with pork belly. The sauce, though a little oily, was flavorful and complex. They rated the spice at a four, but honestly I found it pretty mild. I would've put it more at a one or a two.\n\nDespite those few minor nitpicks, this is definitely a place I intend to bring my husband back to to try more things. Maybe next time I'll try the rabbit.","date":"2013-11-16 19:03:52"}
{"review_id":"zsMAoFWYKzpnGIhap1DkLQ","user_id":"lYEHrma-v7DI2aZ-DRxJQA","business_id":"C_EtrXTygRX5RTUOKtO6Dg","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Nice margaritas and dessert for a midday break.","date":"2019-09-14 20:21:55"}
{"review_id":"o8MQOT3vHPyoUkKgCFpi1g","user_id":"6Q8dQGr_DBKcmQ1aXVWvTQ","business_id":"Dv6RfXLYe1atjgz3Xf4GGw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Went here bc mamas kitchen was closed. The staff is really friendly. There's not a ton to choose from which is a good thing sometimes. I got the Philly steak and my wonderful non vegetarian bf got the Jamaican jerk chick n Ceasar salad. We shared each. They were really good. I got the iced green tea and he got the carrot ginger lemonade. Both were good. The only drawback is that they have no bathroom. Not even a sink to wash your hands. That is gross. They wanted us to walk to the Barnes and noble and use their facilities. Wtf?","date":"2014-08-23 00:19:21"}
{"review_id":"dZRMqd1vN3mWDtasKLVRrg","user_id":"iwyoJK1dMKfRCMtE0AU4vA","business_id":"BTN95ziyTsLpMIoh2ing2w","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"The food at this place is phenomenal but the SERVICE is ABSOLUTELY THE WORST! We were there for a Birthday with a reservation for 10. Our server was completely uninterested in serving us. It took him 20-25 min just for him to come introduce himself and to take our drink order, not to mention the time it took every time we ordered drinks, starters, meals, and dessert. He was abrupt and rude... in appropriate in his responses... then again I guess the guaranteed 18% tip on the big table meant he could treat us like crap and still walk away with a good tip... seriously too bad he made our experience at this place so negative considering we dropped over $500 there last night.... BUT the food is amazing... this server will be the detriment to this restaurant.","date":"2018-11-12 03:55:10"}
{"review_id":"S9gQj4xmND--Vpiex8T6sw","user_id":"VZPxDrqsIeZILZZxkcAHkw","business_id":"Wk21f0DAM7uj3DaJ_rMI-Q","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Hit or miss, but mostly a miss on the food quality. For the prices they charge you'd expect something much better than cheap frozen potatoes \"home fries\" (the term is questionable for what they give you) and watery bland omelettes cooked with vegetable oil.","date":"2018-10-07 20:04:42"}
{"review_id":"5ZDpfqwCmvfyJslkRe0L1A","user_id":"2ZTYZWxpXnE25Xn9VtajVQ","business_id":"PBtZNTQl5tRReeC8It1G7g","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"My girlfriends and I spent 3+ days in the wellness program here.  The hotel was a step back in time in a GOOD way------it felt like old Hollywood!  ALL the staff were friendly and helpful.  Mary and her staff   in the fitness center were great and all down to earth.  We had a very relaxing time in the spa and the cost of the package for the hotel, all food, and all spa\/exercise services was very reasonable.  We will be going back!!","date":"2018-02-05 01:45:19"}
{"review_id":"iCCLkjvY3-Ta8rC2Rqd3BA","user_id":"MS8h7Qe8E-88ml-hHolBSw","business_id":"vzG8THG9K2lDu-Ah6vFAVA","stars":1.0,"useful":0,"funny":2,"cool":0,"text":"I saw three different employees in two different parts of this restaurant. None were wearing masks. Curbside pickup was not available. We walked in the wrong door and were specifically told we had to walk in a different door to pickup our order. Female bartender helped us, was not wearing a mask.","date":"2020-07-01 22:04:49"}
{"review_id":"G25PFwZbMcoamV90X8QSNw","user_id":"60Jbp69Xj2lWcoTIVvacNA","business_id":"TCROPjxfzCZzrQjqLqstSg","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Red Cup Cafe is fantastic.  Sweet or savory, coffee or tea, it's inevitable that you will fall in love with this cafe.  The owner runs the show, and he's such an awesome guy.  From making you feel welcome to making you the best fricken' crepe you've ever tasted, he really sets the bar high for all of the cafes in the NoLibs area.  Anyone who brings me a freshly made chocolate raspberry crepe, just because he wanted me to taste-test it, is A-OK in my book!!  This is exactly the type of customer care that will allow Red Cup to succeed.  \n\nI also highly recommend the egg, goat cheese, spinach, and bacon breakfast bagel.  It's seriously crafted with love, and is hands down the best breakfast sandwich I've ever had.\n\nIn conclusion, I am a fan, and you will be, too!","date":"2011-11-02 19:34:40"}
{"review_id":"Cdzve96sqxMDzRUnLKvQFw","user_id":"_y4ZgRWfbbbbj9NxcaxsKw","business_id":"8QJTzIaR5FceGds8HBSIig","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Amazing. Hazy IPA might be the best I've ever had. Fish tacos were also amazing. Dog friendly on the patio which is a plus. They bring out a giant water bowl!","date":"2020-06-24 03:06:32"}
{"review_id":"3eYh9Tiwhz2RYN-1Hyluhw","user_id":"p5VBfzRuH9dU7Nu_8hymfA","business_id":"2YTJa7DDWx2TQmHu-tPXlg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great place for both children and adults! Have not regretted a second of been there. Lots of interesting things to do! Must have to visit!","date":"2019-09-30 07:08:02"}
{"review_id":"RJMvoIecyTRGAGFbFhcepA","user_id":"pN2w_D7f90_RYpHcdqVYqQ","business_id":"brxzxPTpbukDPTlaq7gOMw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best burgers in town. Go in and get the best food and service in town. You will not regret it","date":"2015-04-11 20:31:14"}
{"review_id":"vNmxTHuM5gk1P8nd5viBVA","user_id":"RCZ5M9o2-fxgFuurpmEs3w","business_id":"ErpOHBaOcmZjnBw0EutQJg","stars":4.0,"useful":4,"funny":0,"cool":2,"text":"The 2nd closest to New York Style Bagels I've found in the area;-)  Nice and chewy!  The coffee is good too, but I couldn't find the cream???\n\nNOTES: If you plan to use a credit card you must order at least $10.00.  And there's no place to sit & eat, so it's Take-out only.","date":"2011-02-27 22:09:29"}
{"review_id":"cIgvpToqcHNCKgnicKGEHw","user_id":"1Z-Jy5i9YkxPvnJDYOTT_A","business_id":"2er_V-oAd7IbQ5YTY56r7A","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Love the burgers here! Variety is awesome and quality is good. Very courteous staff who make the dining experience a pleasure. Will be coming here again!!","date":"2016-02-26 01:01:07"}
{"review_id":"zcQyizOur3XGJndvQ-TzRg","user_id":"O8rwOtiXznUoJoMIsX_Eiw","business_id":"Dv6RfXLYe1atjgz3Xf4GGw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I make sure to stop by whenever I fly to Philadelphia. Staff is very helpful and food is on point. I've ordered the Ziggy burger and the Green Lemonade. Every time I've had to take an extra order on the road. I've eaten at plenty vegan restaurants and its hard to find a place that has both great customer service and great food.","date":"2014-11-06 06:39:32"}
{"review_id":"djqWAUDEp48Xv25_LiQ37w","user_id":"i-xdwlknZMY--DWUfO1reg","business_id":"hFa7UxRZgJDQJ3UBhQsu9A","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"came in for dinner buffet, after the server recommended that we try. they failed to refill several items, including the desserts. I requested several times from the manager to the wait staff for the desserts they offered to be replenished. but they never brought more. we were very disappointed.  would not recommend.","date":"2015-11-02 00:31:34"}
{"review_id":"UEkfvD8A5hhRd8mZp6wnHQ","user_id":"jOUl2p1XTIVIH-iZnTkJAw","business_id":"K-0ysAHUo1XBYcw7hB10hw","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Loved this hotel. Only $40 a night in June '04. Plenty of stuff to see in the Garden District or take the St Charles Car to the Quarter. The common area is nice with free computer to use. The garden is awesome with a great mural. The staff was always really friendly. One of the girls actually took me out and showed me Metairie and Lake Pontchartrain as it was my first visit to New Orleans.","date":"2009-01-18 23:27:25"}
{"review_id":"tiZvmR2Pwj6R2JoIp1Yt2Q","user_id":"obiEHxvIvL0gboeSMgpGzA","business_id":"__yJPcT-C68DuQ4dHdsrmg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I've been seeing Dr Skinner for the past 3.5 years and have always had the best experiences(root canals, crowns, cavities, a tooth implant, and Invisalign). I'm so sad that I can't take him and his awesome staff with me when I move.","date":"2016-08-15 19:40:56"}
{"review_id":"b2a7-Mu_gsSE3W4qFUjuSg","user_id":"I9yJxN2w8lh2Sv7U0WN4Gg","business_id":"WMGc5a7s6K5xX9JPTiRppQ","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"If what you want is really curry in a hurry, this place isn't bad. Not the most authentic Indian food ever, but considering the staff isn't Indian, it's not half bad. I like the naan.","date":"2008-01-05 05:38:45"}
{"review_id":"dDbtPhMx653Pqg7UkW6Xdw","user_id":"GQ51M0I1nYtEvSy_aquBkQ","business_id":"mtGTna-hyFhErb4Zma32IA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Not a bad diner. I ordered the turkey club. The price was reasonable. The service was sub par. 2 waitresses in the place. I noticed a lot of people waiting several minutes at the register to pay. As for cleanliness.... I always take issue with people handling filthy money then touching the bread for toast.. Seems to me they could have someone work the register so waitresses aren't contaminating food. I will not be returning.","date":"2016-02-23 17:37:39"}
{"review_id":"X5ThwmTah6eO-Lhfm99YBA","user_id":"v3ot6X7YcWkIh8diMkVtzQ","business_id":"dNR-b-CsrFGYhMo9zLMrCw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is a gem of a place to eat.  They are very busy during lunch but they are quick, friendly, and the food is yummy!  My favorite is the lettuce wraps with chicken.  It comes with sauces but you don't need the sauce as the taste is phenomenal without it.  My co-worker raves over the cheesy skillet.  This dish comes in a cast iron skillet.  On Friday and Saturday you can treat your taste buds with the spicy pork bulgogi!  Parking is limited.","date":"2017-09-07 17:52:04"}
{"review_id":"cLZTPug29fOo0yp-asGiBA","user_id":"91uyOuNE3ugNUnneTUe3XQ","business_id":"WusgaQ64KO8y2KAAHtTxWQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I walked in there on my first day of moving in to Franklin. I've been back many times since July. I love their food, my family does too.  It's always fresh, tasty, plentiful and well-priced. Apart from the gyros and the salads, I love their spanakopita. Their humus is excellent and so are their desserts!","date":"2014-11-21 04:08:35"}
{"review_id":"vPANN5q-rytZ3MIrCRrxuQ","user_id":"RGK1ASygW8Q4JeJJ-Az9Xw","business_id":"33JlrWf0kmHd2VzW58Wp0g","stars":1.0,"useful":2,"funny":0,"cool":0,"text":"Absolutely awful.  The one star is for our sweet server who was trying her best.  This place just sucked.  My coffee mug had a big lipstick stain on it and my husband's orange juice glass had a big lip smudge on it.  Waitress brought us new ones.  Coffee was not drinkable, it had been poured before the pot was finished brewing and was thus way too strong.  Then, we ordered the popover with apple butter to start.  Popover was a strange, overcooked on the outside, wet on the inside specimen.  Apple butter was definitely straight out of a jar, the cinnamon flavor was overpowering.  Our egg sandwiches weren't redeeming.   My husband's was supposed to come with bacon of which there was none.  Mine was bland and tasteless.  We both got sides of potatoes that might have been good if they had been fully cooked.  Presentation was lame, a little bit cafeteria like, with sandwiches cut in half, separated by a small bowl of potatoes in the middle.  If this place weren't serving mostly out of towners who are staying downtown (who just need a place to eat), there is no way it could stay in business.  I think I've had food experiences in airports that were better quality than this place.  Stay away or do yourself a favor and get fast food instead.","date":"2014-05-17 17:47:19"}
{"review_id":"jgps7g4kHZc9OXihdZYapg","user_id":"IijAi29KA3OkNzj2EA4FZw","business_id":"WLiqfxv_GhFFA5sm878a2w","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"This place has delicious sesame beef, and also big noodles. Love it so much and am very satisfied.","date":"2015-07-25 01:03:53"}
{"review_id":"c1kHvNLKeledN0FipI_D0g","user_id":"LsGmPtY46MAMTdN1FrJNEw","business_id":"I6L0Zxi5Ww0zEWSAVgngeQ","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Nice courtyard with live music. Beignets are decent, but pricey. Fluffier than cafe du monde, and no line, but cafe du monde wins in my book any day. Still, you can't really go wrong here, it's fried dough with powdered sugar- yum!!!","date":"2016-03-18 20:15:50"}
{"review_id":"Ir1xPKWEyTPlH_AT2LQZJA","user_id":"SFxZxk-Orqf5i_1yKQHfZg","business_id":"o3RGMdSY37_PX1k1vZsXpA","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Cafe Ponte is nothing less than exceptional. It just may the the special destination restaurant that you want to eat at all the time. I do. The meal and beverages cost what the do because of the high level of ingredients, the expertise in the kitchen, the knowledge of the bartender and sommelier, and the unbelievable staff. In my book, Cafe Ponte could be dropped in LA, NYC or Paris and never miss a beat. \n\nOur dinner server was Patrick - professional, knowledgeable, friendly. The best. My son had the 5-course tasting menu and added the Heirloom Tomato Salad after seeing I was getting it too. A variety of tomatoes, fried green tomatoes, goat cheese mousse. My husband got the tuna tartare - an absolute vision of loveless and one of the best dishes of the night. Mains included a tomahawk pork chop, scallops (unbelievable), lamb ragu. Each dish beautiful to look at and wonderful on the palate. \n\nDesserts are not to be missed and are generous for sharing. Flourless chocolate cake is dense velvet. The \"Donuts\" with pot de creme will make your eyes roll back in your head. It screams sharing or you will have to take leftovers home as I did. \n\nWine list, by the glass and bottle, excellent. Signature cocktails sublime. So put on that new dress and pull out your good jewelry. Such a wonderful experience.","date":"2017-05-21 18:37:50"}
{"review_id":"3HQ7LrHW6R1WLkI2Rpkxsw","user_id":"58zhqwfGYEl92MZusTsYJg","business_id":"SZU9c8V2GuREDN5KgyHFJw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"in the years since visiting SB we have never eaten anywhere else when it comes to seafood. why would you have to go anywhere else in SB, unless of course you want california seafood with rice pilaf and steamed veggies. i wanted to eat it for dinner but the wife wanted to eat for lunch because of their bisque. aside from their fresh shellfish they also have great crab or lobster bisque which runs out by dinner and they don't make more.\n\ni admit i wonder about the other seafood places on stearns wharf but until SBSC co. ruins a visit from 3hrs away we won't eat anywhere else. \n\nstill can't find shawn and gus...","date":"2010-03-24 03:11:02"}
{"review_id":"4gUe-bx4BI5dFyXVGd5PSA","user_id":"8J7aopYGcxKI6vjxJmL_VQ","business_id":"oZC_VOO3N_xVpWRwpcRvHw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Wonderful.  I was sent there in the middle of the evening by an urgent care clinic whose CRNP thought that my badly swollen, badly sunburned feet could portend a blood clot and I had an 8 hour ride back home to Alabama the next day.  The beautiful young lady doctor (I know, I'm sexist but at 72 who cares) and her friendly staff ran an EKG, did extensive bloodwork and ultrasounded (is that a word?) both legs.  They gave me a clean bill of health and sent me home.  Very impressive, very professional.","date":"2018-07-13 20:23:28"}
{"review_id":"rcO64SWrVC4YEIzoPMnOtw","user_id":"F-OwSluUWMn0vMp3bPWMnQ","business_id":"gk8l75GLFUsFr0kS5uLtkQ","stars":4.0,"useful":8,"funny":3,"cool":9,"text":"Stopped in the other night at a busy time 7 PM service was quick efficient and extremely friendly. The crispy chicken sandwich is just that with fresh lettuce tomatoes and pickles. The server was kind enough to bring the food out to the table as not to have patrons congregating in the front. Always have fresh food and good service here. I have been coming to this restaurant since I moved to Florida over 15 years ago. My friends in the Northeast had no idea what a good chicken on a biscuit was. Until recently when Chick-fil-A actually moved to the Northeast.My kids enjoy this food so if there is ever a question this is where we go crispy chicken sandwich creamy lemonade and oh by the way get an ice cream cone plop it into your Coke with no ice and have the best ice cream soda and make all your friends jealous. The restaurant now uses a eco-friendly container no more Styrofoam. If they would just make an improvement to the Styrofoam cups and those straws. Would they be stars.This location is undergoing another drive-through additional renovation in the back so even though the drive-through is more or less closed this restaurant is always quick and efficient.","date":"2019-08-10 17:16:41"}
{"review_id":"lXQFX7SygyJAZKuxC807eQ","user_id":"cVlfZC9aiZZD_WcY3sTQWA","business_id":"VenhDgh9fRrh9c0Xq0LacQ","stars":1.0,"useful":3,"funny":0,"cool":0,"text":"I don't generally leave reviews. But I'm quite unhappy about this place. Our group of fourteen consisted of three children: 3, 5 and 7. When we received the check, they had charged full price for the 7 year old and 16 for each of the children.  I would highly recommend this change. I do not believe any child 7 years of age is capable of eating like an adult. \n\nBesides that, the food was mediocre for the price. The meat for the BBQ was bland.","date":"2017-05-28 01:02:10"}
{"review_id":"nexLO_FTIp3EpTNVFwYKVA","user_id":"TcPrExN8nLHxyaGsBrW4MQ","business_id":"wFES5bGDiPANW13hNHnXOQ","stars":5.0,"useful":3,"funny":1,"cool":1,"text":"If I could give this place a 10 out of 5 I would. It's everything I've been looking for since moving to Santa Barbara 8 months ago. It's so tasty. The fish is fresh, the sauces unique and flavorful, presentation is beautiful, the restaurant has great decor and a great feel, and the staff is welcoming and nice. the Kobe beef sashimi is amazing...the mango habanero yellowtail melt sashimi is so also a favorite...I've also had the basil press box, Kobe beef press box and the toro press box. The basil one was my favorite, I'd just add a Kobe beef sushi to it ;). I would eat here every meal of every day. So good.\nBeen here about 10 times more since then and still, always an amazing experience.","date":"2014-01-21 08:18:29"}
{"review_id":"V6EgZPp5K-mVtj3z23PuaQ","user_id":"mJbQ9X53KYxCcsxgJegBCg","business_id":"BWITd9JUXP3gSi1z3Y-z8g","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"I'm not usually a pizza fan so you can feel free to take my review and discount it however -- the pizza here is DELICIOUS! the crust is absolutely perfect and not one single ingredient overwhelms the others. Wife & I went for happy hour with our dog in tow and the area for food, drinks and dogs absolutely perfect. The fence is a little too low, if you have a dog that can jump - beware! there's a lot for dogs to look at and be distracted by and immediately on the other side of the fence is incoming traffic! \n\nThe only reason I did not give this location a full 5 stars is b\/c I'd like to see more variety on the menu. \n\nthe price is right for happy hour! \nthe chickpeas they give you when you're seated are so perfectly delicious and the perfect thing to snack on while waiting for food that will still leave you hungry for the food you actually ordered! \n\nIf you go here and fill up on pizza (which you absolutely should) take a walk to the East Falls bridge as a nice after meal stroll to digest before heading home, it's the perfect night out! (that's dog friendly!)","date":"2017-07-03 19:20:11"}
{"review_id":"bSHKfXvF0NzsrWYFnWIiHw","user_id":"zpbLJxulEJKA8ZYnL_UH-Q","business_id":"WLiqfxv_GhFFA5sm878a2w","stars":2.0,"useful":1,"funny":0,"cool":0,"text":"After all the great reviews, I was excited to try this place. Unfortunately, our experience was not great. My soup was bland and the noodles were very firm. My husbands dish was incredibly greasy and bland as well. My green tea was watered down and they claimed to not have tapioca yet about 5 minutes later I saw them serving it.","date":"2012-02-21 21:19:14"}
{"review_id":"GDswaH4sJqnS5N-yGcA5qw","user_id":"aLtJy5qBMpfORw5WFSIPKg","business_id":"LwVhbEy_SHse2G_P2JXMyg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I've visited twice in two days. This place replicates Hawaiian plate lunch perfectly. As good if not better than many plate lunch I've had in Hawaii. What a great concept for fast casual Hawaiian food. The chicken katsu is great! The kahlua pork is perfect with light saltiness and smoke. Even the rice is cooked right! The tall guy behind the counter is energetic and enthusiastic about the customer experience. The portion size, even for the mini, is very generous and the price is very reasonable.  They also have a good selection of Hawaiian Sun beverages. I want to go back right now! So ono!","date":"2020-02-27 23:34:48"}
{"review_id":"1gTo8c-iQuAPA1aginvyLg","user_id":"A4b8X0Pm_pAvadEgdkMZnQ","business_id":"WQ832PDnsDshhbQFm83ISg","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"After reading all of the reviews stating the decline of this cinema, I went yielding low expectations & some tips to keep me happy. I was pleasantly surprised when I was over prepared! \n\nPrepurchased tickets online, ate dinner else where (since other reviewers had suggested the food isn't good there), got there 30 minutes early. Purchased my 10oz glass of wine & bottled water ($18.50 total. Ouch!) at the bar, and walked in with them in hand as one reviewer suggested. Got seated in freshly wiped seats (saw the guy cleaning & it smelled like bleach), and 3-4 servers began to take orders from the room. They were really hustling! All of the food looked like generous portions and looked yummy to Me. Seemed to all be out before the movie started. Unfortunately, I didn't order anything. \n\nI did notice that there aren't any call buttons like I have experienced at other similar luxury theaters. There didn't appear to be a mid-movie service either. \n\nI'd say the owner saw the yelp reviews & quickly took action because I just didn't experience the negatives that have been complained about over the last few months. I'll update when I get a chance to actually dine there.","date":"2016-01-17 16:26:37"}
{"review_id":"GWmr-5Fl8Hjfa1khGoAzBw","user_id":"m7B6Z3SMopfaxXNAVLtNzw","business_id":"TghRoAMx43V-9l7mH-SENg","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Sitting at the bar with my wife and it smells like vomit. It smells so terrible we will no eat here and will not ever come back,\nFor t not being busy and for it so smell like this and have terrible service is beyond disgusting.","date":"2014-09-02 01:08:32"}
{"review_id":"aPLTY2oQT7zCuoQzw7QsRA","user_id":"a7GpIbG2cpKJ-5j2p4_gBw","business_id":"AaWmckcT3O1iQSAIUmzwUA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"We were stay at the Coral Resort only 3 or so doors down so we decided to go her for breakfast. I loved the great selection of local and organic food. The atmosphere was very friendly and we got to talk to who I believe was the owner. The food was great, we got the steel cut oatmeal, poached egg on an English muffin, a bagel and a Clearwater sunset smoothie. All of which were very good, quality food. I unfortunately took off a star because we had to wait about 35 minutes for our food with only 2 other people in the café which seemed a little long to me. Overall I would definitely recommend it for the amazing food and friendly atmosphere.","date":"2015-07-26 15:31:31"}
{"review_id":"E_SXUAsI5G7kPF0mKzXfRA","user_id":"8eC6EOsLTmfVk_35t3ZQqg","business_id":"wJmyu7W1K9A_gE8Ed4Bc9w","stars":4.0,"useful":0,"funny":0,"cool":1,"text":"I was surprised I liked Trident so much considering its a Seal bar and I'm an Army fan :) Love their all day happy hour on Sunday. Most 22oz draft beers are $3 during and they have some $3, $4 and $5 appetizers. The canteen is awesome... I love the horseradish dipping sauce! Their salads are really good as well. Every time I go I just end up getting a bunch of appetizers because there are so many tasty ones to choose from! Definitely a great menu, lots of drafts to choose from and a neat dive bar feel to it. Its a good place to go to before or after UA sporting events because you can walk to and from most of the games.","date":"2013-05-02 18:22:41"}
{"review_id":"NfyrtxSArWHfcFFUtLpLIQ","user_id":"TF3TYgfDz54HoUoOm03Ewg","business_id":"HPVpxcwDVjgZatc4M8bEnw","stars":4.0,"useful":0,"funny":1,"cool":1,"text":"Simply awesome. Consistently great food--either breakfast or lunch.  The waitresses all are friendly and helpful.  I've visited the Frazer Diner about 100 times, and have never been disappointed.  All American diner food - nothing more, nothing less.\n\nNow for those of you who enjoy waiting an hour plus for a seat on a Saturday or Sunday morning, and paying 2x the price you'd find at the Frazer Diner, please, please, please go join jeannine S at the Classic Diner.","date":"2011-02-10 18:21:00"}
{"review_id":"pAYd3JI2Y2_7Sbn8RdLXOg","user_id":"ovGCpbRgUIcw5oAFCv9hMw","business_id":"eJ77e9lGxY3ArzaoDbHhYw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"If there was a negative star I'd use it. Bad service,  watery drinks, and dirty. Where's government regulations when you actually need it","date":"2015-04-25 23:28:01"}
{"review_id":"_13Kl_X1z4w5-KCDL6rjFA","user_id":"HJy8JFBuWl4UKGF4K4uh9w","business_id":"M0r9lUn2gLFYgIwIfG8-bQ","stars":2.0,"useful":3,"funny":2,"cool":1,"text":"The atmosphere was cool.  But the Veggie Burger was horrible.  I like veggie burgers.  In fact, I eat almost anything.  But even my friend that tried a bite of it spit hers out.  However, everything else was ok and I do want to give this place another shot (but ordering something completely different).  But I really hope they fix that veggie burger recipe.  \nI also think that having only one bathroom on the first floor was weird considering the place was packed at lunch.","date":"2011-10-27 22:27:15"}
{"review_id":"TLnUVIyTtid7mdhcDt8v4w","user_id":"dKL394mtLVVybju3QTOtvg","business_id":"k3sED9tpGEOtzhGxvcxTrw","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"My family checked this place out in March. We were very disappointed. It is managed poorly. The staff is frazzled and have no idea what they are doing. The meat was very poor quality. It smelled like dog food and tasted about how you would imagine dog food to taste. They advertise on their website a kids meal including a choice of 4 main items plus a drink, cookie, coloring book and colors. On Monday night it's kids night where kids eat for $0.99. First they gave me only a taco and when I reiterated that it was a kid's meal they added a few stale tortilla chips and drink. I was going to let it slide until they charged me $3.29 for the kid's meal plus an additional $1.00 for (beef taco) the main item. I spoke to three different people including the franchise owner and not one was remotely apologetic. This place is terrible and I would advise that no one dine there.","date":"2009-04-09 20:30:32"}
{"review_id":"lvb2cylysz-4xgupOfQbOw","user_id":"Amsw-kuYL_tVAXcdfdlmMA","business_id":"oJ4ik-4PZe6gexxW-tSmsw","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"This place was on my radar due to a lot of recommendations. We ate here last Sunday afternoon at around 12:20 PM. \n\nSince my fiancé and I had been exploring the area a bit, I was a little warm and wanted to dine inside. While dining inside shouldn't have been a big deal, what we didn't realize that after we were seated inside near the bar, we would not even be helped until 15-20 minutes after being seated. Everyone was seated outside at this time. I don't think our server even bothered to check inside. This was the first red flag. When the bartender asked if we had been helped, that was when our server came in and took our drink order. \n\nThe Bloody Mary that I ordered wasn't even mixed, and my fiancé got the wrong beer. We thought about complaining, but we wanted to give more chances, since this place was highly recommended by others.\n\nApparently, there were only two cooks in the kitchen, so they were pretty backed up. A woman that was dining outside had complained to staff that their orders were taking forever. We just waited patiently and twiddled our thumbs. Our server never told us the status of our food and didn't seem friendly to us. We only overheard the delay from the bartender and the woman dining outside.\n\nAbout 40 more minutes pass until a man who appeared to be in-charge asked us how we were doing. By this time, my fiancé and I have decided that if the food doesn't come in 10 minutes, we're leaving. It's ridiculous that an order of two veggie burgers takes about an hour to arrive. This man in-charge seemed pretty stressed and told us that he was going to make things happen in 10 minutes. He apologized about the delay and comped our food. This guy-in-charge is Broad Ripple Brewpub's saving grace.\n\nOur food arrived. I ordered the Southwestern Veggie Burger that was supposed to come with salsa. It did not. However, at this point, my fiancé and I just wanted to eat. We were not going to complain since our food arrived. The burgers were nothing special, but it was decent for the price we paid.\n\nThis place didn't leave a good impression and we are not going back. We applaud the manager for dealing with the stressful situation of having only two cooks during the Sunday lunch hour. We left the bartender a little tip because she was the one who actually noticed we weren't helped before our server. I did not like our server. There seemed to be no shortage of servers, so there was no excuse to not even be helped after 15-20 minutes of being seated. She didn't even offer us waters. I really wish that the tips didn't go to her and that they went to the bartender, the manager, and the cooks that were struggling.","date":"2019-06-29 18:46:25"}
{"review_id":"meGcUUVsVp7dgPmmIpwY1A","user_id":"dNYzZ2yU2YlHCyDbo66pTQ","business_id":"XaSNISuTB4DKvzS3Rug5Nw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Unexpected excellence!  We had the Seaweed salad, miso soup, rock shrimp, spicy maki combo, the daily special crazy spider roll, and the waitress-recommended chestnut roll, and because we were hungry, added the shrimp mei fun.   Everything was so good!   We brought our own wine (an Albariño).   The mei fun had fresh crunchy bean sprouts, the specialty rolls were fabulous.  Generous amounts of ginger and wasabi.  And we brought home half the mei fun, and half of both specialty rolls.  We devoured and tried everything else.  I wish I could get more of the seaweed salad!  Pleasant atmosphere.  Thank you with kudos to the chef.","date":"2017-07-27 20:08:23"}
{"review_id":"1ewSdoJvg45tx0bxgI3HDA","user_id":"bGzQKxnNgOcPBCzad1Px0g","business_id":"smKLreTouMRNVoa1ocP5TA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Did a fantastic job with my Chanel bag. Excellent service with quick response time. Worth every penny and highly recommend!","date":"2020-11-28 22:53:55"}
{"review_id":"12EJZkHfqFWlguJcD0CGlA","user_id":"njJjEOLRTo03Fwp4jg_Jpg","business_id":"NUGu31Ou05hGdZ1YPhVdNA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Dude. It's not just a Target. It's a Super Target. How 'bout that? Heading to your first year at IUPUI or UIndy? This is way closer than IKEA. Just saying. We still desperately need one downtown, but until then, this may be easier than schlepping to Glendale.","date":"2015-03-17 22:01:53"}
{"review_id":"8H1pQTNlb6d45KOY-_k1Mw","user_id":"9oCPxOlN2W1Y5zaMGTAWew","business_id":"mDsElkXohOsEOH46cpx_Xw","stars":1.0,"useful":6,"funny":3,"cool":1,"text":"I literally wish I could give this place a zero. This was possibly the worst dining experience I've ever had. Honestly, we did have warning bells go off when we turned in to the parking lot, which previously was so full, we'd have to park all the way in the back, today was ridiculously empty. \n\nOur host was pleasant enough. But then came our waiter. He couldn't seem to get our order right. Even while writing in his little notepad. He kept asking us the same questions over and over again. My friend and I both ordered off the Amore Monday menu ($15.99 for the sirloin, an appetizer -I ordered the meatballs, she ordered the calamari, and we both chose Caesar salads). \n\nThis is where it gets a little shifty. Our waiter came out with a receipt (two $15.99 meals, and two $2.59 for drinks), pointed out a series of numbers in the middle of the receipt and told us that if we went online and filled out the survey, we would get free dessert and he would take extra good care of us. Being the trusting idiot that I am, I told him I'd do it, which I did, and gave him and the store the best scores possible. There was a new creme brûlée cheesecake that I wanted to try. Didn't seem like a bad deal. \n\nOur apps came out (20 minutes apart, mind you, but we didn't think it was a big deal). Then our Caesar salads came out (she had all hearts while I had all leaves, and both of us had no croutons at all, but again, no big deal). Then our steaks came out. This is where things really started falling apart. As my friend and I started cutting in to our steaks, blood was spurting out. Our steaks were completely red in the middle. She had ordered hers medium rare, so she was able to continue eating, even though it was completely rare. I, on the other hand, ordered mine medium well. I tried taking a bite to see if I'd be able to stomach it. I couldn't. It felt like I was eating raw meat. I decided to send it back to get cooked a bit more, which wouldn't be too bad, if our waiter hadn't gone MIA for a good 25 minutes. I even heard the table across from us ask another waiter where their waiter (same as ours) had gone. It's also worth it to say that this whole time our drinks were completely empty and hadn't been tipped off once. By anyone. When our waiter miraculously re-emerged, I told him about my steak, which he agreed to bring back to the kitchen. By the time my food had come back out, my friend had finished her whole meal. Again my steak wasn't cooked as medium well, but at least it wasn't completely red in the middle anymore so I just sucked it up and ate it. \n\nAt this point, our waiter puts a dish with the most unsavory looking gelato on the table. He says its for filling out the survey. I explained to him that the way he had worded it earlier, he made it seem as if we would be able to pick our own dessert. He said, nope, this is what you get for filling out the survey. Now I'm feeling a little cheated. I took the time to fill out their survey and gave them the best possible scores, and the only thing I got out of it was crappy service and melted awful gelato (that we couldn't eat, it tasted so bad). But I told myself it was my fault for not being more specific and asking him more about it. We ask for the check and I mention that I have a 20% off coupon that I got in the mail. \n\nTell me why our meals, which we know are $15.99 each, and were charged at $15.99 on the first receipt (that he brought out when he wanted us to fill out the survey), had now been changed to $17.99 each. At this point I'm starting to lose my patience, but I stayed polite. I called him over and calmly asked why we were being charged $17.99. He said it was because we had sauce on our steaks. When I told him it's clearly written in the menu that it's included in the price, he mumbled some other nonsense then loudly called over the manager to come deal with us. When the manager came over I asked the same question, and he replied that it's because we had fettuccine Alfredo as our sides. I told him no one told us it was an extra charge. He said no big deal and he'd fix it. 10 minutes later the receipt comes back out with only one of the meals at $15.99. I tried telling the waiter about this again at which point he started catching an attitude with me, which was completely undeserved as I was completely civil with him. He snatches the ticket of the table, comes back 5 minutes later, slams it on the table and leaves. My friend ended up paying with cash because we didn't even wanna stay there long enough to wait for a card to come back. And she left him over a 20% tip, because, again, we didn't wanna wait there any longer than we had to. As we were leaving, there was the manager standing at the podium with a host and hostess eying us as we were walking towards the door. Obviously didn't even try to hide the fact that they were talking about us. \n\nTLDR: worst experience ever. Don't eat here. Service is crap. Food is crap. Never coming back.","date":"2016-02-23 03:58:42"}
{"review_id":"yM-slGbQTDJx-78V2JWYNg","user_id":"MMQ41ZVPd3y5ucoYMBTm9g","business_id":"OWOTBvbukTtRywo_WowaCA","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Absolutely awful.  Ordered wings for the Super Bowl.  Was assured it was no problem to have the order ready for 5:30 pickup.  After an HOUR wait, the wings were not even cooked completely.  Tasted as if they were boiled, not fried.  And, they tried to charge my son for ranch and celery!  Really?  Last time.  Too many other places to get wings.","date":"2017-02-06 21:32:35"}
{"review_id":"zbRgbefSC59zdjwhOqnqVQ","user_id":"EYh9dNZ8150JbQ0VLKeKJA","business_id":"Y3ZCO17N1_T_Ms1JmswwzA","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"Amazing food!!! Looks like a hole in the wall kind of place but those are always the hidden gems. The stuff the tacos, so i was full off of three! They were quick and efficient. Loved it!","date":"2020-08-04 00:07:42"}
{"review_id":"PTpyjj7qbubLy3Tvx5ljHA","user_id":"JGdOHsgGa4l-_-ZAswljmg","business_id":"t1qF12NdW8KvCqxqbvy-Hg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place hits the spot on every note. Strong coffee, delicious biscuits, & perfect NOLA atmosphere. Love it.","date":"2015-05-31 13:35:15"}
{"review_id":"ggZ4EfKY5h-3aHPKniOBug","user_id":"Q6h7l3gr7YByL-XhAeGP5g","business_id":"lbJ5QUeszGeUTUdCYWGfyg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Amazing service, friendly movers. \n\nAfter browsing several moving options in the area, Green Truck was by far the least expensive.  This low price does not reflect in their services, however.  Movers were quick, and took precautions by padding the walls and doorway, as well as carefully wrapping up delicate items\/furniture.  \n\n$25 for Vandy students doesn't hurt, either :)","date":"2016-06-17 21:01:31"}
{"review_id":"J63g0kNVlCcqIOfSdjA-Yg","user_id":"4r33dXcE1oYZxjONrhxTiA","business_id":"Zi-F-YvyVOK0k5QD7lrLOg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"We were in NOLA in October 2012 for a convention, and spent a good bit of time walking around the French Quarter, like the rest of the folks who come to NOLA. While I am no big fan of the Bourbon Street experience, I always find that there are great places to visit in the area, and never 'throw the baby out with the bathwater...'\n\nWhile walking around the area, we decided to pop into Muriel's for a quick lunch after exploring the Quarter. After walking by too many junk and trinket shops, we needed a place that would be able to seat us quickly and allow us to placate our 3 year old. \n\nThe staff was very friendly, the decor was quaint, and the food came quickly and was well-prepared. The vegetarian medley plate was absolutely superb - a nice change from the heavier non-vegetarian entrees we indulged in all week! The crab and shrimp salad was crisp and properly portioned.\n\nThe wait staff was very polite, and were helpful when our silly little one decided that flipping over in her chair would be a great idea - while she was busy shrieking, they rapidly brought a nice plate of ice cream that made her forget her fear of falling - way to go, guys!\n\nOverall, a very nice impromptu experience while in the French Quarter without breaking the bank or making us wait forever for a table. Merci à bientôt!","date":"2013-04-13 00:16:17"}
{"review_id":"5ux0LoMwwZ9hI3-R4B-P6A","user_id":"FfEsV8jjjVH7MwOSL5XMZQ","business_id":"ejRuEF2j8_w5qQbwEQ8GfQ","stars":1.0,"useful":3,"funny":0,"cool":0,"text":"This place loses 2 stars from me. an hour for delivery when I live right around the corner?..i ordered spaghetti and meatballs...wet thin noodle with terrible watery red sauce and the meat were clearly bought from the frozen food section at save a lot. It had ZERO taste and I had to throw it out. Step up the quality of your food.","date":"2014-11-23 01:24:51"}
{"review_id":"Dgc9j1Ql-O_Upo9jtbZ3Dw","user_id":"TspTSK2vj_bHjZVE1DHaxQ","business_id":"14JwHj1Cxs5bkkJg5iuPog","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Quick friendly service. Dan, who rescued me when I locked my car keys in the trunk of my car, was very friendly and he arrived in 15 maybe 20 minutes had me in my car with in 10 minutes. Definitely will use alpine again.","date":"2018-04-21 05:30:51"}
{"review_id":"25fZfyMiJ6pfUdsfET-5OA","user_id":"IML25ULTDCnR_o58BIQWuA","business_id":"n5P6-HWN3kFSYBxfVfDxEg","stars":1.0,"useful":7,"funny":2,"cool":2,"text":"This SOHO contessa was spending her fifth year wedding anniversary at Clearwater Beach. A group decided to go to Shepard's. The tall dark guy standing at the window checked everyone's ID and we then we proceeded to the bar. The bar, seeing we were classy ol' folk served us and then asked for a wrist-band. \n\nLong story short: the guy at the window said\"I knew u wood be back\" he let us leave without bands to be a dick! We kept our classy cool. Then, the security walked us out rudely. No need....this SOHO Queen has better. So trashy! I was with gorgeous company, so odd for them to be so aggressive. \n\nI've never. Heathens. I need a spa treatment stat- I'm going to Sand Pearl where I belong!","date":"2019-02-02 04:33:55"}
{"review_id":"YRS95SoMbWqJAziTtygcqg","user_id":"D_jS6w2j1mFzb2KoYncCaA","business_id":"_kSaLnFZIEpOZEg6ZIxKvQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We live in Venice Beach and only come to Philadelphia once a year so this is our first experience of High Point after it transitioned from Mugshot and we are very pleased to be able to have a lovely, delicious, low-key and comfortable neighborhood coffee shop. My latte was delicious with lots of foam. The barista was very welcoming, especially since we're from out of town.  I will certainly return.","date":"2018-05-11 15:21:00"}
{"review_id":"jNe0UWQV-intM-lNIiv03Q","user_id":"9vLVGnFO1njoHCHkocbTuw","business_id":"TUhRukcZb3tG0cB_X68FCQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Noboru Sushi Buffet. The best steak they gilled there, medium rare, juicy with original favor taste when you spilt pepper and salt.  Korean owners run Japanese sushi buffet that gilled best western steak!!!!\nThe service is great, the difference between other sushi buffet, you got most attention and best care. usually you go to buffet restaurant, you always have poor service. Noboru give you the great foods and best service.","date":"2011-09-04 05:09:40"}
{"review_id":"J4MaPRxMuyru0bWcQrCMSQ","user_id":"7Nb-POL9XZCbboAzBu5Qvw","business_id":"9zaXFApfobvEKgfGt-NUxA","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I don't write many review on Yelp but I was very impressed with Rittenhouse hardware on my latest trip to pick-up a few things today. I anticipated a wait + bit of an hassle to shop around on a Saturday afternoon. However, these guys know what they are doing. They are well-staffed on busier days and I've always seen at least one person on the floor + one at the counter even on a week day, which means you're not wandering around aimlessly looking for supplies. Within moments of walking in, I had my random list of items from door knobs to pepper spray (which was an awesome surprise since I had no clue where to find that stuff). \n\nOverall, they make the most of their prime location but somewhat smaller space (in comparison to an Ace or Walmart that is) with great  employees that know what they're doing + a great variety of products that are main-stays for fixes and home improvements. As a novice to changing locks and using Spackling walls, they kind of made my afternoon. Kudos to management and to your awesome team!","date":"2012-12-16 04:19:55"}
{"review_id":"xqz_-Pf345kbba0eFMtUzw","user_id":"5_GK6YXHdOlmCtggB0JlPQ","business_id":"HJe8eEH5qXRjQMAh1VfV_w","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Seriously, this spot is dead-on fantastic!! We had impeccable service; Establishment was *imnaculate; Food unbelievably fresh & delicious!! Our Chef was so personalized to needs @ our *Hot Grill*! He sang, cooked and just overall made everyone's experience special We had a couple of Cocktails (Mudslide & the most perfect Mai-Tai) I've drank in a while. Great pours! Dinner was *Trios* for me w\/Lobster, Shrimp & Scallops. Mignon\/Scallops. Biggest Sea Scallops ever. Meat was so tender you could cut w\/a fork if ya needed to!  Seafood so fresh. Now, this came w\/Soup, or Salad; Egg Fried Rice; Mixed grilled Veggies w\/Mushrooms & Noodles. WHEW!! ALLOT! You most likely will need a *To-Go* box as everyone did @ our table. This is a dining experience, not your run-of-the-mill. Total=$171 w\/TIP.  \n4- Cocktails, California Roll & 2 Dinners! I HIGHLY RECOMMEND this  restaurant.!! I will be back & would like to say, \"Thank You\" to entire Staff. Finally got exactly what I want to pay for. EXCELLENCE","date":"2020-08-10 00:14:12"}
{"review_id":"W2Or9aIoIiF6E6YWe3O02w","user_id":"DvP8pq7QzV11_0968ahxMQ","business_id":"B-DiQpcSTJ7oMMnwzbAGTQ","stars":4.0,"useful":3,"funny":2,"cool":0,"text":"Remember when Tyson Bee's first came out, before the disappointing change in management, and everyone was raving about its crazy food truck innovation and tremendous fusion of flavors??\n\nWell, THIS is the new THAT.\n\nI've never had anything quite like the food here. It's a little bit Thai, a little bit Mexican, and one hundred percent amazing. The Cap'n Crunch crusted tilapia burrito is one of those masterpieces that hinders me from keeping entirely vegetarian. Its subtle sweetness works perfectly with the spicy sauce, huge avocado chunks, and crisp greens. The veggie burger is also solid, and the curries all look fantastic.\n\nThis would totally be a fiver in my book if it weren't for the painfully long wait time. Since the food is so darn good, I might be able to forgive this, but the way they taunt you with incredibly tantalizing aromas is just cruel.","date":"2012-04-20 19:07:13"}
{"review_id":"WqBc-DmYDiPZdLdrPdCT2w","user_id":"1Zm4ZGG33vQY0_RjzCFC1g","business_id":"okKaZt47m3hhUi24KwBadQ","stars":5.0,"useful":3,"funny":0,"cool":0,"text":"While driving down 1 over the weekend, I stopped in a bunch of random beach towns, checking out local businesses and eating as much of the local favorites as time and stomach capacity could allow. By the time I hit Santa Barbara,  I decided that my experience would not be marked by a memorable meal, but by a new piercing.\n\nI hopped on Yelp, and thanks to my fellow Yelpers, I discovered Golden Eagle Tattoo. Situated on bustling State street, next to an adult bookstore, Golden Eagle has an exceptionally inviting vibe, with its open front and casual vibe. I was quickly directed upstairs, where he piercings were done.\n\nI was greeted by a casual, yet professional guy, named Johnny, who promptly introduced himself, asking for my name and remembering it through my visit. (Nice touch, especially when I have pre-piercing butterflies.)\n\nI got the cuff of my left ear pierced with a small hoop, a piercing that I have had before, but let close. The piercing room was very clean, with instruments packages from the autoclave. There was an emphasis on cleanliness and sterility- always comforting in a piercing studio.\n\nWith a one, two count and a few deep breaths, the piecing was done, before it began with little to no pain. It looks awesome and is healing nicely.\n\nOverall this has been my best piercing experience, and it is a shame I live so far away, because I would go again the next time I want something pierced.\n\nThanks Johnny!","date":"2010-09-07 21:23:23"}
{"review_id":"wtTy6zx1yp8s8d04fxDmtA","user_id":"mR-samhhbKBOOi3G_-i6TQ","business_id":"YfGl5XVVjGdearXRuZQFnQ","stars":3.0,"useful":6,"funny":0,"cool":1,"text":"This is a pretty good place to get a last minute mani or pedi. There are tons of great pros but also some cons.\n\nPROS: they do have some great technicians but others are pretty bad and you really have to know who to ask for otherwise your experience could be black and white. They do follow pretty good covid sanitation from what I can see. The receptionist is friendly and knowledgeable (Jody). They have hundreds of nail colors to choose from and gel manicures can be done during your lunch hour if you are trying to squeeze in a service. They offer aesthetic services too although I've not gotten any of those. The pedicure chairs have good back massagers built in. It is likely you can book an appointment for you and a friend or even 3 of you. \n\nCONS: twice now, I've had a nail technician (during a pedicure) drop an instrument on the floor and pick it up and continue to use it on me. This really is the biggest reason for star loss in my opinion. My nail polish on my toes also only typically lasts 10-12 days before mayor chipping. Not sure if it's the brand they use but my pedis at other places in town last 30 days without chipping. They do use pedicure chairs which they line with plastic but it does have a shared plumbing so I always kinda worry about how sanitary that is. I have come here enough that I know the price of the service I'm getting but I've heard some customers get confused at checkout and not understand what some of their up charges are for. They also recently instituted a mandatory $2 charge for your own nail kit you get to take home (nail file and buffers). They explained that they don't make any money off this charge and it is simply bc they have had a harder time getting supplies. I go to other nail salons in town and have not heard them say they are having difficulties getting disposable supplies. It is quite possible although I just feel a bit odd with the long story of how they go on and on about \"not making any money on these\". \n\nWill I go back? Somewhat very likely bc it's easy to get a last minute appointment and worth it if I can get a technician I know does good work and I will be more vocal about stopping them from using dropped equipment. Is it a spa like experience? No although the decor is lovely and the prices are reasonable if you make sure to know what you are asking for and getting before booking. They have service menus, just ask. Also ask how much things will be if you are asking for additional services like nail designs or deluxe pedicures.","date":"2020-08-17 05:38:30"}
{"review_id":"Q1genq6pWtRpTRV2C4gyTQ","user_id":"XCvk1nyFO-yCAz3zExnTNQ","business_id":"WoFttPbJRti49sXBgOeIBQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"I was not able to check in for some reason but the hubs and I went to this new location last night for the first time.  First impression - they need more parking.  The parking was ridiculous and there were more cars having to park in grass lots across the street than in the actual parking lot.  Its a brand new location so the inside is nice and clean with everything being new.  But because it is new - it was packed! We waited for over 30 minutes for a table inside.  It was just too hot for us to take the option of outdoor seating.  I was worried that our food would take forever since they were so packed, but amazingly, our food came out SUPER FAST, correct and was very good.  I had the honey mustard chicken sandwich with fries, the hubs had blackened wings and we had the jalapeno poppers as an app.  Everything was very good.","date":"2013-06-14 13:48:59"}
{"review_id":"TIJ2NDNBAc4UHhkq-ZcF5Q","user_id":"deVz7CbX6fUp12x690FQNw","business_id":"ompDR5sUDpoI6gnTldmneQ","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"I experience food from this restaurant at the Convention Center.  The line was out into the venue so I thought it must be good.  I had the chicken wings with the rice and greens.  There was no option to substitue for the oka or two green vegetables.  They ran out of some items in the interim and I was given a double green instead.  The greens were terrible.  I would like the chief to know the friend chicke was good but it could have used some lemon pepper or creole seasoning.  Overall I will not return to this restaurant on my next trip.","date":"2013-07-08 13:42:04"}
{"review_id":"1mto-75kYc4QeL6nWb28xQ","user_id":"Dckv_Y50j4D12p7eFGcuHg","business_id":"ctax8shu5cROWBAZ1vmk5w","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"I was visiting NOLA when I had a flat. I called NTB and spoke to a young man who told me he would take care of my tire the next morning. He had it in stock. True to his word he was there waiting for me at 7:00 this morning. He fixed me up in time to get to my meeting. He was knowledgeable and kind. I can not say enough about the customer service. Thanks for getting me on the road!","date":"2018-10-27 14:49:49"}
{"review_id":"iChYGJwjnLBspHPKZSob6Q","user_id":"2eCTQoBJETQSU-Oi9gjyuw","business_id":"roc-xyyzN5b_nImb0NdRLQ","stars":3.0,"useful":1,"funny":0,"cool":1,"text":"The Earl is a nice spot to grab a sandwich before your flight or even to take it along. I have visited this location a coupe of times and they have taken care of me quickly and efficiently. \n\nNot a whole lot to say other than if you are looking for a good sandwich at the Philly airport, give these guys a try.","date":"2016-10-24 22:43:24"}
{"review_id":"QIZIzI7rxKSw2zmmXHcFIw","user_id":"YRk5je53X7cmoji9J7s35A","business_id":"VD4mZEBNiCeyGSq51XV9jw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Seriously the best pizza in the Treasure Valley.  They do an incredible job that is consistent.  Do yourself a favor and try this pizza!","date":"2021-03-28 02:06:07"}
{"review_id":"CH0wSr7UYzkRhiDaJoY1FA","user_id":"wWa9X07Cq8EVaqJrA5QKyA","business_id":"hfN3l0gJ-XszD1XFGNvA6A","stars":4.0,"useful":1,"funny":1,"cool":0,"text":"Food was excellent, though portions are rather small. Place can get very busy on a weekend. Called ahead to make a birthday reservation, and only later was told right in front of my guest about a $10 surcharge for a birthday fee. It wasn't explained to me well, and the timing of the request was poor, so I declined. Then the manager intervened and told us more about it, and I let them go with it. They turned the radio and lights off, and present a spectacular display. I enjoyed the food and was glad to be able to sample their sushi with BYOB and BYO dessert. I plan on returning sometime when they are less busy and see if this will help achieve faster service.","date":"2013-10-02 13:56:16"}
{"review_id":"GkTwgu_DD69cxlApgy3t7A","user_id":"5o2B--6i8wJOD-q2TiQX7A","business_id":"QHzOlsTXfspSOMJ5SCxeCQ","stars":5.0,"useful":3,"funny":1,"cool":1,"text":"Do not go another day in your life with out stopping into this carnivores paradise! Alex's has been around foreverrr and it is for obvious reasons. I highly recommend the pulled pork sandwich, ribs, Mac n cheese, onion rings, cole slaw, beans....umm yeah pretty much everything. All I'm saying is when you smell the smokey gold rolling out of Alex's firepit while at the ehrlich and west village light don't just keep going, pull in!","date":"2015-02-19 16:25:21"}
{"review_id":"CZzYl77yA6s2uBdHs43rMg","user_id":"uUE9WheAqwSITxWfH2YplQ","business_id":"sIAkisIQNKwDTxBBfGRnJA","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Terrible.  Made us get out of the taxi at airport because we weren't going far enough.  Everyone in line was appalled.  Could not have been more rude or more arrogantly","date":"2017-04-10 22:09:13"}
{"review_id":"Whi2HzjFw_UtyRsaaFT5eQ","user_id":"y5gQgN-OMwSh9zwuctBfvw","business_id":"FtTrAxQUY7_HHGPRPEI5DA","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Have to agree with other reviewer Tampa bike share maintenance seems to be badly lacking as of late.I use bike every day as part of my commute to work and it is getting harder to find a working bike ,when there are multiple bikes on the racks.Platt st. In front of publix many times has only 2 bikes at station and both have been broken for weeks now! Convention center usually  has more non working bikes than working ones.Harbor Island  the same.Love the ability of using a bike just wish I was able to do it more often when needed. Step it up Coast Bike Share....Please!","date":"2019-01-14 19:46:39"}
{"review_id":"LJc8X4kbkHwnN7IUbY1CPg","user_id":"rutISFv-5uLB-vb_IuLNow","business_id":"rnaE88k8yV5pFAGJeiIK4Q","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"The Knitting Factory is legit as far as I'm concerned.  Went to see the Gabba Gabba Heys last night, and they were pretty decent.  I'm guessing this is an all ages venue, judging by the fact that there were little kids in the mosh pit.  It has concrete floors, so if you're all old and have back problems get the reserved seats.  I wouldn't recommend them otherwise, as they seem to be in a crappy location, and you pay over double regular admission price.  The bar is pretty standard, overpriced beers and all (six bucks for one Newcastle?).  One handy feature is the coat check, just bring a couple bucks and they will hang your business up.  Overall, a great venue with better sound than the GSR theater.","date":"2011-02-27 21:28:09"}
{"review_id":"Ub-ErU46VwHLa1B1dsN7vw","user_id":"08-Mz2_eqmnLrXjmlIr_NQ","business_id":"2KIDQyTh-HzLxOUEDqtDBg","stars":5.0,"useful":6,"funny":0,"cool":0,"text":"Where do I even begin?  My love for this place runs deep. Whatever you are in the mood for, Mazzaro's has it and it's going to be amazing. The sandwiches from their to-go counter are delicious. The Asiago stuffed gnocchi you can grab at the pasta counter will change your life. If you like amaretto pick up an amaretto ball from their dessert counter. I don't think I've ever gone without having their spicy soppressata stocked in my fridge. The two gentleman that work in the wine section are always so friendly, helpful, and knowledgeable.  If you are going to splurge on food, this is the place to do it.","date":"2019-08-03 12:58:38"}
{"review_id":"qeiHv7vXL1lnxEpRXQWYrg","user_id":"lfS2n5r2go3QuaOO7mtYwQ","business_id":"UrHoigU1jqudyj8fthMKCw","stars":5.0,"useful":3,"funny":1,"cool":0,"text":"Very solid dealership! Buy a car from Lou Fusz","date":"2010-01-28 07:33:28"}
{"review_id":"YlOI7ramSfnWb3xzQPsVUQ","user_id":"WaXIlTbbJOhdkVyrqCRK3w","business_id":"Vnob_w_Aohf7ZDqxcJ9z2A","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"This is one of my favorite pho place! The kimchee burger is good too! Recommend to come on weekdays, because on weekends this place is always pack.","date":"2017-04-20 20:52:16"}
{"review_id":"07637Zm8XuW5-bO8mvDRvg","user_id":"mRYfnrRboeRMvJv0JZberg","business_id":"rOsC1rDpIxvNoHxEvNFjeA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Cool bar. Great atmosphere and comfortable leather chairs. Had a drink here only but the menu and food looked great. Service was friendly and we were waited on very fast. Cool place to hang out with a group of friends.","date":"2016-03-06 00:35:37"}
{"review_id":"cs5ybC6mFopo4sB1ApvXIw","user_id":"VZL2gLwwc5Sq-wFfT57zDQ","business_id":"ymoEdJB5NE56sWw74uyX7A","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Went here for the great food I had experienced before. \nAfter HORRIBLE service, flagging down the waitresses, & being told they were out of all drinks except alcohol & water, my friends and I left leaving cash at the table to cover our tabs but did not tip. The staff proceeded to call my boyfriend a nigger & follow my friend outside threatening to call the cops.  I was disappointed in the wait staff but their intolerance & bigotry will definitely prevent me from ever going back.","date":"2018-05-19 02:13:54"}
{"review_id":"djKsndWqoP7sdGwNo6kuAg","user_id":"OU1RHtsPQmU4wa-1d5mwuQ","business_id":"g04aAvgol7IW8buqSbT4xA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Absolutely delicious. I don't get seafood for breakfast but the Oyster Benedict was amazing. As was the coffee.","date":"2016-03-01 22:30:49"}
{"review_id":"1azOwtosmfbNd3F_6w4rRw","user_id":"kN4RpIql4T4Rv8dnJVybaQ","business_id":"RuEIK45gBF5iDbYoSa9tOA","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"Great selection of craft beers on tap,the service is so so. Sometimes they are awesome other times it's brutal. .30cents for a sample that they offer you is bad customer service as well. I have been to Underground a few times but with other craft beer locations available my trips to this place will be less frequent.","date":"2015-12-17 04:19:06"}
{"review_id":"hIIjI5ONelY783Or5l4UVQ","user_id":"ejodn7PCiZ1xLTMSZ29W6g","business_id":"NnlQhXtuVOVjUFYB1Hqp8Q","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Just had such an amazing experience here! Got a full cut- so a consultation, wash, cut, and styling. My stylist was Kristen and she was super cool, knowledgeable, and had a great sense of humor! Everyone was very positive, real, and welcoming. My hair looks a million times better than when I walked in, and I am confident it will grow well. I will surely be coming back here in the future. Love a salon that is both down to earth, and makes you feel special. So happy to have found a local salon I can make my go to! Update: it's been over a month and I'm still obsessed with my cut! Grateful for someone who can cut curly\/wavy hair and have it look great with just air drying. Literally have to do nothing!","date":"2018-11-20 14:10:40"}
{"review_id":"5doy7RMwkn71Y9C7QvlBOw","user_id":"dMxeKYXiI3TZpWc-PfwViQ","business_id":"8eDkw7CE0NKqMknPIu26fw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Try the creamy grits, tell are really good. Under the sea omelette was a new take on the omelette and better than a standard omelette.","date":"2017-09-15 16:12:50"}
{"review_id":"11eXm1K2EVhNskih-2ySEw","user_id":"EEb5JhVwVi02YmY-qy4kKg","business_id":"jUyv6KzYbHmdV3KvbiPmvA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We had some repairs done to our roof by Hallmark. They we very fast and completely professional.","date":"2016-01-05 21:06:59"}
{"review_id":"bhe6IsgCgf-TspeAauCNkg","user_id":"1CSCSiAKlZK5zT6IFvDIyw","business_id":"gSw40iA-LM2XrPeJttMGWw","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Get one of these and you'll be drunk while also not putting a dent in your pocket. 10 dollars when you first purchase and $7 dollar refill. As long as you keep the container you can keep the $7 deal \"for life \"as the sales women said.","date":"2019-05-24 23:13:53"}
{"review_id":"2xVtp3RAzbphl4l4obFMRA","user_id":"iBMGmNNOlOV-hzl4seLjqg","business_id":"9_m_iA3VAqGBJEW5XLc-5w","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Four stars is an adequate rating of this establishment.   While the food is excellent, the ambience and service can be overwhelming.  I found myself constantly distracted by the rants the cashier would go on to each customer.  My Cuban was very good.","date":"2021-01-30 14:54:49"}
{"review_id":"9QpRRfeSJNPNmnvy1RZ2Ww","user_id":"vs1ozNme3r-GEx-PXQ8MLQ","business_id":"GUMVStVaJfWmCIpQA4TtHg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"I went to Crazy Sushi for dinner last night for the second time.  This is a great place to go to if you are looking for some good and creative sushi in Philadelphia.  The restaurant is BYOB which is a plus.  \n\nMy boyfriend and I ordered the gyoza to start and four special rolls - Crunch Kani Roll, Ichiban Roll, M16 Roll and France Roll.  The France Roll is my favorite roll at Crazy Sushi.  All the rolls were presented together very nicely on one large plate with a few decorations.  I highly recommend making reservations for dinner on the weekends as it is usually packed.","date":"2014-11-22 19:39:58"}
{"review_id":"TB5-pScI798Temy5fmZJZg","user_id":"izVDKSbpBfn90_IIA7pN5A","business_id":"f4aCur7Vrf9F8YUAOFFWiA","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"A young man from Nothing Bundt Cakes came into the business where I work today and asked how many employees we had working, I told him 25 and he then proceeded to give us 28 mini Bundt cakes. I asked him why and he said they were out giving cakes away in hopes of earning our business in the future. They were absolutely amazing and when we have events or need sweets we will definitely be calling them! Great PR and great cakes!","date":"2017-04-23 02:49:57"}
{"review_id":"LX8RzD3iY3n9_6MWLPeIOA","user_id":"5DG4gWgea05tEAAgOAu7Sg","business_id":"2XYPFRm7teCUr3eGsB2-qw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Restaurant looks extremely dirty and food is about average.   Waited an hour for my food.","date":"2019-01-06 01:05:57"}
{"review_id":"UhDOc6QtiTXhWpRtvXV9EA","user_id":"vHwqo5qrucAOWF1kyuHWJg","business_id":"gmjsEdUsKpj9Xxu6pdjH0g","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Did the 5 in 1 tour tonight!! LOVED it!! We were a party of 6, Michael was our tour guide, he did a FANTASTIC job. Kept everyone's attention (even my 9 year old son) and kept us all wanting to hear more. \n\nThis is our 3rd trip to N.O. And each time we come we do the tour (different companies.). This has been the best one by far! Highly recommend!","date":"2017-09-04 04:34:00"}
{"review_id":"IJyxfQYDkk-t-qdTCV9NbQ","user_id":"H-ROZEeDUP5j4DjLXn8iOA","business_id":"M0c99tzIJPIbrY_RAO7KSQ","stars":3.0,"useful":2,"funny":1,"cool":3,"text":"Located right between the Gateway Arch and the Old Courthouse, very conveniently near to everything downtown. Busch Stadium is just a few blocks away as well.\n\nOn our first night, we were given a room that was less then adequate, with virtually no view. The plumbing, we learned later, was leaking down to the room below us every time we flushed our toilet. After finally being notified by maintenance, that this was going on at around 11:30 PM, we were soon reassured that they now had everything under control. But by morning, there was frantic knocking at our door and we were asked to relocate to another room, ASAP; rather gruffly. I had to set a couple of the maintenance guys straight that if they hadn't fixed the problem the night before, though reassuring us that it was under control, that I didn't appreciate their attitude now. Needless to say, their demeanors soon changed to a much more polite and pleasant \"yes sir\", \"sorry sir\". Our next room was a much more pleasant upgrade. Don't take my meekness for weakness!\n\nBut overall, a fairly nice stay...in spite of a few mishaps.","date":"2015-12-12 22:47:10"}
{"review_id":"_zqcZSvByNWov_E9FLDflg","user_id":"Qrj6fezJR0ASNlGivQAqUQ","business_id":"9gObo5ltOMo6UgsaXaHPWA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Good food, great service and beautiful view of sunset & the city at night! \nThe server got a great sense of humor. We got lobster, pork chop, filet mignon and seafood tower. All was delicious.","date":"2020-02-27 06:04:20"}
{"review_id":"Ar4EF0BHcSe1KqVaGtPfoA","user_id":"N4jD8vmerG36fc1utUf1lA","business_id":"Ph6-SNyEK_CIOzARiJhG6A","stars":5.0,"useful":4,"funny":1,"cool":0,"text":"Best crab cake sandwich I've ever had. Period. Simple fresh ingredients on a bun so soft and pillowy I just wanted to crawl in and go to sleep in it. I'm staying at the doubletree across the street and could eat here everyday. The second time I went I had the shrimp salad with big fresh pieces of shrimp in a zippy mayo dressing. Yum!","date":"2017-05-03 17:06:31"}
{"review_id":"CS6rKCP0wnM3TsS9NbMB9Q","user_id":"YFTfQD5bicESr4BvzZ5jKQ","business_id":"2bl6G1zgXUHbMGwEocqMSg","stars":2.0,"useful":2,"funny":3,"cool":3,"text":"Despite all the hype, I felt Dave's Dogs were severely overrated. The previous reviews were not off-point when saying the hot dogs were good, but they were not the best hot dogs I've ever tasted.\n\nDuring my visit, I tried Dave's Style and the SB Style. Both were solid in that the ingredients looked fairly fresh and it was well-cooked. However, given its price, it easily could've been a Costco hot dog (which is bigger) with additional condiments placed on top. \n\nThus, taking into account the price, hype and execution, I felt that Dave's Dogs are beneficiaries of a strange bandwagon effect. Tldr; Good hot dogs, but overpriced and overhyped.","date":"2016-01-06 04:41:07"}
{"review_id":"51axD7tFGCi2VO_Q9FCbXQ","user_id":"Mbdxi4O-tvOAmltasjEPog","business_id":"OuJ9rEv3NbMOSndjQyqtGw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Went there today for our first time. Food and beer was great. Finally a place that not only offers Bavarian beer! Germany does have many more kinds of beer to offer!!! But please!!!!! Get the Kölsch Stangen! The original glasses for Kölsch. It doesn't taste the same in a Bavarian Bierkrug. \n\nBTW: a Döner is definitely a good that most German eat, but don't forget: it's Turkish. Maybe you can add some more original German food one day. \nBut your Döner sandwich is definitely the best I've had here in Florida so far. Great job! \n\nWill definitely come back.","date":"2018-04-06 03:44:01"}
{"review_id":"0D7I7nxcUlznOoRRDMu1kA","user_id":"jFSrZYDK85AM4Yhrbg99kg","business_id":"QJfM8uRNy6KHhj6kIatzmg","stars":2.0,"useful":1,"funny":0,"cool":0,"text":"Great atmosphere.  Went for an opening on Friday night.  There was art, wine and appetizers. \n\nThe wine was good. The glass sticky and with white spots (assuming towel residue). It didn't help that the young lady serving was holding the glass by the top where my lips we supposed to go. Anyway,  I asked for another clean glass of (yes FREE wine ) and this is were it got weird.  The lady serving obviously got upset and ugly in her \" there you go DEAR!\"\n\nOH DEAR. oh well.  \n\nToo bad. The petite cheese croissants were absolutely delicious.  \nthe art is ok. the crowd very Clayton indeed.","date":"2015-02-14 02:12:39"}
{"review_id":"aHOLtm5oHc_y75cAKyJ5uQ","user_id":"8uA5kIezHLCR2ee3B9G47g","business_id":"_rLyUxKd3oIi-bZPSzottg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"I make at least one trip to Haslam's during the winter month I vacation near St. Petersburg. The prices on previously-owned books are a little higher than some used-book stores.  But the combination of new and used under one roof is convenient.  Haslam's is a local institution and I hope it stays around forever.","date":"2019-07-15 21:03:20"}
{"review_id":"2uRujE18lpZPWDmB7syEHA","user_id":"BS3cZAKF2Cuacqd-NQzUTg","business_id":"EtKSTHV5Qx_Q7Aur9o4kQQ","stars":3.0,"useful":2,"funny":0,"cool":1,"text":"The food is definitely good. Do I think that it's worth the prices attached to it? Not really. I think that for the price, I expected something spectacular about the burger that I ordered and the burger was good, just not extraordinary. The space is cute - very narrow and a little tight so not good for large groups. We ended up sitting at the bar, which was perfect for catching up with a friend. I hear the duck fat fries are good (I personally don't really see the hype), but I will tell you that the brioche bun the burgers are served on are pretty great. I would recommend for lunch, if you can get there before it's too crowded.","date":"2015-07-29 19:33:43"}
{"review_id":"SKEkh554tvgX61F5BCY7qA","user_id":"lYKhgWhlr-JC1xeJ6qaigA","business_id":"Uy0r4bzRmY5LFtDfzNgkag","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Lots of deliciously greasy food for really cheap, and really cheap beer...a pitcher of Dos Equis is about $6 I think. In addition to being cheap and greasy, the food is actually really good...not as authentic as the holes in the wall on Cherokee, but easily the best you'll find anywhere else in the city.","date":"2009-07-21 01:19:17"}
{"review_id":"0ZWF3RYcoImtUtFLfR_zfA","user_id":"aaOMM6pxlO42xi86xbDf0w","business_id":"4Hyfm0Ly3yo96RJTVShTIA","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"This was only my second time at a Texas Roadhouse but was very pleased with the food and service. As expected it was packed on a Friday night so we got a beer and a wine at the bar and ate peanuts in the waiting area. We were seated within 20 minutes and were lucky to have Max as our server. He was super friendly.  The food was great had a Pittsburgh style ribeye cooked perfectly and my dining companion had a filet which he said was excellent . The bread the salad and sides (loved the seasoned rice) were all  very tasty.  I will definitely return","date":"2019-03-23 15:06:17"}
{"review_id":"3U8eKKr3UwCUR6hPeMyatw","user_id":"dJyKe5M3niXnwPgIbRXEgA","business_id":"vgZwA2X7X5oGcui9BDBgbw","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"Purchased chicken salad with pecans and grapes, pecan tart & rolls. Everything I put in my mouth was scrumptious. I also noticed they sell local honey. I would highly recommend visiting.","date":"2018-03-03 23:09:46"}